{"Samsung": "The Samsung Group (Korean: 삼성) is a South Korean multinational conglomerate headquartered in Samsung Town Seoul.", "one": "1 (one also called unit and unity) is a number and a numerical digit used to represent that number in numerals.", "two": "2 (two) is a number numeral and digit.", "minutes": "Minutes also known as minutes of meeting (abbreviation MoM), protocols or, informally, notes are the instant written record of a meeting or hearing.", "months": "A month is a unit of time used with calendars that is approximately as long as a natural orbital period of the Moon; the words month and Moon are cognates.", "samsung": "The Samsung Group (Korean: 삼성) is a South Korean multinational conglomerate headquartered in Samsung Town Seoul.", "week": "A week is a time unit equal to seven days.", "hour": "An hour (symbol: h; also abbreviated hr) is a unit of time conventionally reckoned as .mw-parser-output .frac{white-space:nowrap}.mw-parser-output .frac .num,.mw-parser-output .frac .den{font-size:80%;line-height:0;vertical-align:super}.mw-parser-output .frac .den{vertical-align:sub}.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px}1⁄24 of a day and scientifically reckoned as 3,599–3,601 seconds depending on conditions.", "Bissell": "Bissell Inc. also known as Bissell Homecare is an American privately owned vacuum cleaner and floor care product manufacturing corporation headquartered in Walker, Michigan in Greater Grand Rapids.", "years": "A year is the orbital period of a planetary body, for example, the Earth moving in its orbit around the Sun.", "weeks": "A week is a time unit equal to seven days.", "year": "A year is the orbital period of a planetary body, for example, the Earth moving in its orbit around the Sun.", "Tool": "A tool is an object that can extend an individual's ability to modify features of the surrounding environment.", "One": "1 (one also called unit and unity) is a number and a numerical digit used to represent that number in numerals.", "almost": "In set theory when dealing with sets of infinite size the term almost or nearly is used to refer to all but a  negligible amount of elements in the set.", "hours": "An hour (symbol: h; also abbreviated hr) is a unit of time conventionally reckoned as .mw-parser-output .frac{white-space:nowrap}.mw-parser-output .frac .num,.mw-parser-output .frac .den{font-size:80%;line-height:0;vertical-align:super}.mw-parser-output .frac .den{vertical-align:sub}.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px}1⁄24 of a day and scientifically reckoned as 3,599–3,601 seconds depending on conditions.", "second": "The second (symbol: s abbreviation: sec) is the base unit of time in the International System of Units (SI) (French: Système International d’unités), commonly understood and historically defined as .mw-parser-output .frac{white-space:nowrap}.mw-parser-output .frac .num,.mw-parser-output .frac .den{font-size:80%;line-height:0;vertical-align:super}.mw-parser-output .frac .den{vertical-align:sub}.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px}1⁄86400 of a day – this factor derived from the division of the day first into 24 hours then to 60 minutes and finally to 60 seconds each.", "days": "A day is approximately the period during which the Earth completes one rotation around its axis, which takes about 24 hours.", "Brush": "A brush is a common tool with bristles wire or other filaments.", "Turbo": "A turbocharger (technically a turbosupercharger), colloquially known as turbo is a turbine-driven, forced induction device that increases an internal combustion engine's power output by forcing extra compressed air into the combustion chamber.", "day": "A day is approximately the period during which the Earth completes one rotation around its axis, which takes about 24 hours.", "last": "A last is a mechanical form shaped like a human foot.", "HEPA": "HEPA (/ˈhɛpə/ high-efficiency particulate air) filter, also known as high-efficiency particulate absorbing filter and high-efficiency particulate arrestance filter, is an efficiency standard of air filter.", "Roomba": "Roomba is a series of autonomous robotic vacuum cleaners sold by iRobot.", "Shark": "Carcharhiniformes", "Ball": "A ball is a round object (usually spherical but can sometimes be ovoid) with various uses.", "Floor": "A floor is the bottom surface of a room or vehicle.", "feet": "The foot (plural: feet) is an anatomical structure found in many vertebrates.", "LG": "LG Corporation (or LG Group) (Korean: 엘지), formerly Lucky-Goldstar from 1983 to 1995 (Korean: Leokki Geumseong; Korean: 럭키금성; Hanja: 樂喜金星), is a South Korean multinational conglomerate corporation founded by Koo In-hwoi and managed by successive generations of his family.", "Cope": "The cope (known in Latin as pluviale 'rain coat' or cappa 'cape') is a liturgical vestment more precisely a long mantle or cloak, open in front and fastened at the breast with a band or clasp.", "Box": "A box (plural: boxes) is a container used for the storage or transportation of its contents.", "past": "The past is the set of all events that occurred before a given point in time.", "Youtube": "YouTube is an American online video sharing and social media platform owned by Google.", "season": "A season is a division of the year based on changes in weather ecology and the number of daylight hours in a given region.", "ROBOVAC": "A robotic vacuum cleaner sometimes called a robovac or a Roomba as a generic trademark is an autonomous robotic vacuum cleaner which has a limited vacuum floor cleaning system combined with sensors and robotic drives with programmable controllers and cleaning routines.", "inches": "The inch (symbol: in or ″) is a unit of length in the British imperial and the United States customary systems of measurement.", "YouTube": "YouTube is an American online video sharing and social media platform owned by Google.", "Christmas": "Christmas is an annual festival commemorating the birth of Jesus observed on December 25 as a religious and cultural celebration by billions of people around the world.", "Hours": "An hour (symbol: h; also abbreviated hr) is a unit of time conventionally reckoned as .mw-parser-output .frac{white-space:nowrap}.mw-parser-output .frac .num,.mw-parser-output .frac .den{font-size:80%;line-height:0;vertical-align:super}.mw-parser-output .frac .den{vertical-align:sub}.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px}1⁄24 of a day and scientifically reckoned as 3,599–3,601 seconds depending on conditions.", "Arm": "In human anatomy the arm is the part of the upper limb between the glenohumeral joint (shoulder joint) and the elbow joint.", "Hammer": "A  hammer is a tool most often a hand tool consisting of a weighted \"head\" fixed to a long handle that is swung to deliver an impact to a small area of an object.", "Vacuum": "A vacuum is a space devoid of matter.", "Dysons": "Dyson Group trading as Dysons is a bus and coach operator in Victoria Australia.", "Aussie": "Aussie is Australian slang for Australian, both the adjective and the noun and less commonly, Australia.", "vacuum": "A vacuum is a space devoid of matter.", "Mini": "The Mini is a two-door compact city car that was produced by the British Motor Corporation (BMC) and its successors from 1959 until 2000.", "zero": "0 (zero) is a number and the numerical digit used to represent that number in numerals.", "Secondly": "2 (two) is a number numeral and digit.", "weekend": "The weekdays  and weekend are the complementary parts of the week devoted to labour and rest respectively.", "MAJOR": "Major is a military rank of commissioned officer status, with corresponding ranks existing in many military forces throughout the world.", "seconds": "The second (symbol: s abbreviation: sec) is the base unit of time in the International System of Units (SI) (French: Système International d’unités), commonly understood and historically defined as .mw-parser-output .frac{white-space:nowrap}.mw-parser-output .frac .num,.mw-parser-output .frac .den{font-size:80%;line-height:0;vertical-align:super}.mw-parser-output .frac .den{vertical-align:sub}.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px}1⁄86400 of a day – this factor derived from the division of the day first into 24 hours then to 60 minutes and finally to 60 seconds each.", "half": "semi-/demi- (from Latin)"}