{"screen": [2.823529411764706, 0.15061176470588236, [4.0, 0.9116, "Amazing and snappy, but with caveats", "First, the price point for this at $30 under retail was great, but it would have been nice to purchase the 16GB option.\n\nAs a first time macOS user, the setup was quite bumpy. Rosetta seems to work great with certain \"unsupported\" applications, in some cases not expecting it to work at all, and would without any hiccups or noticeable slowness. This was the case with Runelite and enabling the GPU plugin made the experience buttery-smooth on an LG 3440x1440 IPS display.\n\nHowever, Firefox (without installing the beta M1 supported version) would consistently freeze and crash and it seemed to be ruled out by plugins, but even without that, certain websites wouldn't work and loading pages after each click took way too long. I experienced another bug with Discord and couldn't see its login setup screen due to what seemed like a file association or visual glitch, and I found out there's no good uninstaller option natively on macOS other than just binning applications to the trash and clearing it from there. So, I had to uninstaller a third-party app to remove all file associations when the application was installed to finally get a clean install and thankfully the Discord install worked well after that.\n\nThe other downsides for me are general unsupported SOC from various companies/applications, in case I wanted to setup a VM. No eGPU support, and no RAM upgradeability, but that's a given considering the new SOC, just would have been nice to upgrade on our own (and hopefully have made design tweaks to make those upgrades easier for users). Would also have been nice to see a smaller footprint for the enclosure, since it's quite a small SOC based on images I've seen online.\n\nYou may find yourself feeling like a beta tester, it can get pretty frustrating. So consider yourself warned. Hopefully companies release M1 compatible applications soon. Overall, I'm fairly satisfied and hopeful for more application support in the future. Would highly recommend it for more casual users because it seems like it would be an amazing value under that use case.", [0], [257, 382, 387, 388, 13, 147, 20, 275, 155, 283, 160, 292, 44, 301, 46, 174, 48, 175, 316, 190, 330, 331, 339, 340, 345, 218, 347, 221, 223, 226, 103, 360, 362, 108, 237, 110, 366, 373, 246, 254, 377, 252, 126], ["review", 14]], [4.0, -0.3438, "Snappy performance. Mostly..", "Replaced my old iMac 27 with this Mac Mini M1, which turned out to be much cheaper than getting a new 27\" iMac, even with a new 4K monitor factored in. However, I did lose functions like adjusting my monitor's brightness on the apple keyboard and a good quality build-in speaker. The speaker in the mac mini is worst than my iPad, so an external speaker is a must. Also, for some reason the mac mini did not detect my apple keyboard in the setup screen, I had to connect my PC's USB keyboard to finish setup and add my apple keyboard in my Bluetooth menu. App wise, most apps worked pretty good, but Thinkorswim, a stocks charting app I use, does perform worst than my old intel based mac.", [], [65, 39, 8, 41, 7, 140, 46, 53, 120, 125, 126, 95], ["review", 4]], [5.0, 0.0, "It’s a nice MAC", "Its small, fits in well where I need it. It’s powerful, can handle many tasks at once. it crashed on wake up from screen saving, the music continued but the screen was all colored snow, didn’t respond to anything except shut down. Never has happened since.", [4], [1, 3, 5, 37, 14, 54, 24, 29, 30], ["review", 3]], [5.0, 0.4404, "All the advantages of MACOS in a small package", "Most striking is the opening screen that demonstrates the capability of the chip and Big Sur OS. The possibilities for your project are limitless. Audio, graphics, and visual display are as good as your equipment can handle.", [2, 7], [1, 35, 5], ["review", 2]], [5.0, 0.0, "M1 Mac mini", "I lost 2 iMacs last year during a powerful thunderstorm and needed to replace them. This little machine has handled everything I have worked on. The photo I uploaded shows the Arsenal match playing on part of the screen and something I was working on in another. The machine is virtually silent and takes up very little space on my desk. There are enough ports for all of my devices and it works with all of the other computers on my network.", [1], [1, 35, 8, 40, 19], ["review", 4]], [5.0, 0.0, "Not running good. My screen keep freeze.", "Not running good. My screen keep freeze. I tried one week and decides to return it and got full refund.", [2, 5, 7], [2, 5, 7], ["review", 1]], [5.0, 0.5719, "GREAT lil' machine!", "M1 is fast. Sync-ed up to my screen perfect", [0], [8, 9], ["review", 1]], [1.0, 0.4215, "Not What It May Appear", "I purchased two directly from Amazon with 8 ram and 512GB storage. Like others in this thread, Bluetooth didn't work, machine continued to freeze and say out of Memory and several other issues. I decided to return both items knowing this would be problems down the pike. Anyone looking to purchase this machine. Definitely purchase it with more than 8 GB of ram, or you may have screen freezing and messages appearing on your screen saying out of useable memory. Thankfully I was still able to return both items.", [], [5, 75, 76, 13, 48, 82, 89, 27, 60], ["review", 5]], [2.0, 0.0, "Returning", "8GB seriously, you watch all these youtube videos of people running their tests and show how quickly it scrubs timeline, but all i get is spinning logo. occasionally it will just crash and restart. random flashes on screen. its either overhyped or each machine is hit or miss. i am returning and waiting till all issues are fixed. i'll stick with my 2016 macbook pro for now.", [], [1, 34, 52, 41], ["review", 5]], [1.0, -0.6377, "terrible apple computer 1st and last", "i tried this mini pc its actually bigger and heavier then most mini computers and theres only 2 usbs on this others have 4+.the displays are limited to 2 on a thunderbolts and hdmi port you cannot connect both to the thunderbolt ports and the dual screen options are minimal while in use liek screen stretch is not a proper function.although the processor is fast and the system is quiet its not useful for todays work enviroment with limited display qualities.", [0, 2], [73, 79, 47, 55, 26], ["review", 0]], [3.0, 0.765, "Great computer, EXCEPT that it doesn’t work with my monitor", "I like the computer. Bought it mid-April, 2021 and posted this 10-days later on Apple forum:\n\n“Immediately after Mac Mini M1 Big Sur 11.4 update, Sceptre C27 monitor began going to black screen. Restarting monitor restores normal function momentarily before it goes black again and monitor cycles black and normal randomly. C27 works normally with Dell desktop and Acer display works fine with Mac Mini. Tried different DVD cables and power supply, same results.”\n\nAs of June 20, eleven other forum users have indicated the same issue, but Apple support hasn’t responded.\n\nUnless you are ok with accepting a crap-shoot on whether your chosen monitor will work with your great new computer, I suggest you wait until Apple support gets around to addressing this Big Sur OS flaw.", [0, 1], [1, 3, 133, 134, 16, 22, 23, 37, 41, 63, 68, 70, 71, 100, 101, 110, 112, 124, 126], ["review", 5]], [1.0, 0.4588, "No video", "No image at all on my monitor. I unplugged my 2012 Mac-mini to replace it with this 2020-M1, but the screen remained blank. Online, I discovered that this problem is not uncommon with this new M1 Mac-mini, and there is no rhyme nor reason for which monitors and which machines do not work together. Evidently, it's hit and miss. I tried everything that tech support recommended, to no avail. I had to give up, and return it. Now I'll have to wait for the next updated model to try again. Quite a disappointment! I'm just glad my old 2012 is still working, though I've had to quit installing OS updates due to incompatability.", [0], [0, 32, 66, 73, 74, 107, 45, 77, 112, 22], ["review", 8]], [1.0, -0.296, "There is good way to adjust the font size.", "In order to get larger font size on the screen of my Dell monitor, Apple says, reduce the number of lines.\nIn other words, have the screen set for a lower resolution. I found no other way of of getting large fonts.", [2], [34, 39, 9, 15, 20, 30], ["review", 2]], [1.0, -0.4767, "Half Baked", "My 8GB Mini was plagued with problems right out of the box. Random pink screen when booting and flashing green/pink horizontal artifacts when using the desktop environment. Kernal crashes at the App Store when applying updates. Then after wiping the OS I get errors when creating a user account regardless if I use iCloud or not. This is a terrible user experience coming from Apple. It feels like I’m using a Linux box with outdated drivers. Never have I been so frustrated with a new Apple product. Note: this isn’t happening to everyone, but there are a bunch of similar experiences popping up on message boards. Some say it's a Big Sur/hardware driver issue, but whatever it is, it's rushed. Apple blew it with the cheapest entry to their M1. What a shame.", [], [2, 68, 6, 72, 139, 46, 15, 48, 152, 89, 26, 93, 30, 63], ["review", 10]], [1.0, -0.1027, "Always a bad idea to buy a Mac", "Here is what Apple does, they stop supporting products that are built so well they last decades. They sabotage the software and make it impossible or very difficult to maintain these products. I could give dozens of examples.\n\nIf you buy this Mac you will have to upgrade to a new one in five years. for some reason they will no longer support and you will find software you paid for no longer works because of changes they made to make it not work any more.\n\nApple is in bed with the advertisers and your screen is under their control. Now that Apple has moved away from Intel, you won't be able to install Linux on your machine to bypass all that.\n\nWant an Apple? Buy one with an Intel CPU so when Apple suddenly decided to cripple your machine and screw you over, you can still use it to run Windows or Linux.", [2, 7], [65, 3, 67, 101, 132, 7, 8, 134, 76, 109, 14, 46, 110, 144, 20, 152, 92, 29], ["review", 8]], [3.0, 0.8481, "Not quite ready for prime time", "I've owned Macs since their Powerbook 100 released 29 years ago, and before that, PCs running DOS and CP/M, in addition to dozens of Macs over the years. I recently sold my Mac Pro and matching Pro Display (add them up: $12,000), and just sold both: I figured Apple would migrate to a new, proprietary chip, and they have done so. And when I heard through the rumor vine that they were going to issue one, and possibly two, Mac Pros (one is reportedly half the size of the current monster, and the other will be same-sized), plus a less expensive, consumer-oriented display, I figured it was the time to get an interim Mac computer to hold me over for a year or two.\n\nI bought the Mac Mini with the M1 chip and 8GB of memory, with the Apple-sponsored LG monitor (Ultrafine display, 5K), and assumed it'd be clear sailing.\n\nIt wasn't.\n\nThe first problem is that, no matter what anyone tells you, you're better off getting the 16GB of memory, because otherwise you'll be swapping memory constantly, with three or more programs open, and using software to clear the RAM. The second problem is a software glitch or hardware glitch in the graphics processor that causes jagged lines of text! This is a random issue, which makes it even more frustrating, because it can't be isolated and resolved by the user. The third problem is that you cannot hook up two Apple-sponsored LG monitors to it (the 5K and the 4K), which is what I wanted to do. In fact, if you want to hook up two monitors, it MAY be possible, but Apple users online are reporting difficulty in doing so. (Your mileage will vary.)\n\nBottom line: I'd skip the Mac mini M1 and wait for them to come out with an iMac with the M1 chip. Then you'll be able to add the memory you need, have a beautiful screen, and possibly a new classy chassis because the rumor is that the iMac for 2021 will be redesigned and resemble the Apple DXR display: the iMac hasn't changed its basic look in, oh, years.\n\nApple makes great products. But the Mac mini M1 has flaws that may make you wish you had waited for a new, improved model. It's good value for the money, to be sure, but the iMacs have proven to be more reliable, and of course, the latest Mac Pro I had (which was more power than I needed, which is why I sold it) was a real workhorse, and a showpiece: I'll happily buy the forthcoming Mac Pro with the M1 chip when it's announced.", [2], [384, 385, 512, 516, 135, 136, 264, 391, 271, 273, 150, 151, 280, 408, 414, 37, 426, 428, 433, 178, 306, 436, 442, 187, 59, 315, 191, 192, 450, 455, 200, 328, 456, 333, 463, 95, 352, 481, 228, 234], ["review", 15]], [1.0, 0.0, "Not For Business Professionals", "I really wanted to like this machine. I spent hours of time researching specs, benchmarks, applicable applications that would would work with and without Rosetta. I read articles, watched YouTube videos and contacted friends fully in the ecosystem to see if this could be a good addition to my collection of computers. After reading, hearing, and watching people give this machine good reviews I pulled the trigger and got it. Was not impressed even in the least.\n\nI knew when buying the machine that I would need to buy a displaylink adapter to get the computer to run 3 screens. I knew when I got it that some had occasional Bluetooth disconnect issues. And I knew that it had limited ports.\n\nWhat disappointed me is that this machine is slow, and ill equipped to handle a business professional work load. I say business professional because many YouTuber’s feel that being in media creation is the the holy grail of a professional work space, when it is not. So a lot of information presented there is heavily biased in that way. I am an accountant, I occasionally dabble into content creation. This machine, for me, was not great at handling my professional needs so it was useless to me.\n\nI got a constant message saying that the unit was low on memory when it wasn’t. I had used 16/256gbs and the ram usage couldn’t have been that high either. I got the message when rendering a 30 minute video in Adobe Premier while on a zoom call with 3 or 4 Safari web pages open. I literally had to close out a few programs so it could focus on only one task because it couldn’t handle it. As an accountant working remotely due to COVID, being on Zoom or Skype is crucial. I cannot have a “work” or “professional” computer unable to handle this load.\n\nI paid roughly $713 for this computer and feel cheated. If you are a business student, professional, or entrepreneur I would strongly advise you to get a windows machine. Yes, the chargers are thick. Yes, they need to be updated. And yes, they aren’t perfect. But this ain’t either. Get yourself a device that can make you money and free yourself time. This device is not that expensive for what it was supposed to be. But do yourself a favor and save your money and get a Dell XPS, HP Envy or Spectre, or a Lenovo. You will spend more money but it will work right out of the box allowing you to make more money than what you spent. It’s an investment piece.\n\nMy advice is don’t get caught up in the hype, the machine is trash. Many people buy the cheapest most crappy windows and hate it because it’s slow, huge, ugly and old. They save a buck or 2 and switch to a mid tier apple machine and think the world of it while no realizing that they have not ever gotten a comparable windows machine. If your budget is rough 750-1000 for a computer and you are thinking of going with Apple because...apple. Think again, and think seriously. Do some real research and avoid people who are followers. Be an independent thinker", [], [2, 131, 4, 135, 391, 398, 145, 530, 533, 407, 413, 541, 543, 548, 38, 169, 432, 50, 568, 195, 69, 454, 456, 589, 463, 81, 210, 466, 597, 220, 350, 607, 229, 614, 488, 105, 364, 367, 243, 382], ["review", 36]]], "system": [3.736842105263158, 0.22555789473684212, [5.0, 0.4005, "Impressive and so far has lived up to the hype.", "It's fast., quiet, and cool to the touch (I've never heard a fan come on).\n\nI've owned a number of Macs since the original Mac SE and this one has quickly become my favorite. I like the Mini's form factor and its ability to use existing monitors and keyboards. I also find that it's faster, quieter, and cooler than the 2014 Mac mini that I also have in the house. I've also had no compatibility problems with software and hardware. It's successfully driving a LG 34\" Ultrawide monitor at 3440x1440 resolution with a USB-C cable.\n\nOthers have complained about the lack of ports on the Mini, but quite honestly with a USB hub you should be able to connect as many devices you want to the Mini. I have 2 USB hard drives, a USB webcam, a USB microphone, a USB selfie-light and an Apple USB-lightning connector for iPhone/iPad/Apple keyboard. No problems.\n\nThe 8GB RAM/256GB SSD of memory is sufficient for what I do (browsing, MS Word/Excel/Powerpoint), music, video playing, light photo editing and some light development work). I've hooked up an external hard drive so I can offload data that I really don't need to be on the SSD (music and photos).\n\nTwo caveats to anyone that is looking to purchase this (or any Apple Silicon based Mac):\n\n1) Make sure you do not need to run Windows or Linux either through VMWare Fusion/Parallels or Boot Camp. While Rosetta 2 will allow you to use Mac applications that run on Intel Macs, it will not let you run Intel-based Linux or Windows operating systems (either via BootCamp or VMWare Fusion/Parallels). Look to one of the remaining Intel-based Macs if you need this capability.\n2) Get the memory and disk configuration you want at purchase time - especially memory. Neither are user upgradeable. You have a bit more flexibility with storage since the system does have Thunderbolt and USB ports.", [0, 4], [256, 129, 259, 7, 265, 144, 17, 147, 153, 26, 31, 32, 287, 291, 37, 41, 169, 44, 46, 176, 177, 52, 201, 75, 343, 89, 91, 219, 99, 361, 366, 117, 120, 125], ["review", 16]], [5.0, 0.0, "Update: to previous Really mixed issues", "Update: The lower review was for a M1 mini 8gb/256 that ended up with a port problem that was causing issues. Amazon took it back and I ordered this 8gb/512 to replace it. First Apple product in 48 years that I have ever returned and that includes 42 Macs. This one still has the built in limit of 1 monitor per interface... USB and HDMI but I'm only using one on it right now anyway. It will now boot on a Thunderbolt drive where+as the returned unit would not. The ultra high security precautions that Apple has made on the newer machines is somewhat frustrating as frequent code words, passwords and security checks are very common and often interferes with my work flow but that is a little like complaining about having to fasten seat belts. Photo work, especially with M1 ready apps is really a breeze. App launch times and renders are much faster than my 5K 27\" 32 GB/2TB SSD iMac and I find myself moving to this Mac Mini more and more even with the smaller single monitor. So... it went from three stars to a 5 star machine and I almost never give 5 stars to anything.\n\nI have had no issues with this machineAs a Mac user since 1984, this is a difficult review. I have always considered Apple products to be vastly superior to other personal computers on the market and their OS to be unquestionably the best. Well, this Mac mini may change my mind. First of all, if you simply want a computer to browse the internet, send email, etc., it is a speed demon expert at that. If you want other things, like normal dual monitors, external boot drives, etc., then this computer has its issues. Now running OS 11.3, I have no ability to boot from an external Thunderbolt 3 drive. I had that ability with 11.1 but lost it when I upgraded the system. Don't even think about booting from any sort of USB drive. It will NOT work. USB drives of any type (SSD, HD, Thumb) serve as file storage containers... not boot drives. The monitor situation is truly strange. A HDMI and a USB-C monitor will work together but it will not support two HDMI or two USB-C monitors. I finally settled on one HDMI and one VGA (through a USB-C VGA hub). They seem to work well together. I also attempted to use the Luna Display adapter for allowing my iPad Air to be a first or second display. You cannot use the VGA adapter or any type adapter when the Luna adapter is plugged into the USB-C port or the Luna will not work. There are sometimes costs to being early adapters and this seems to be the case with the M1 Mac mini. Though it does read/writes to its custom memory at nearly 3000MBs and loads native software very rapidly, it really just isn't ready for prime time yet for a lot of users. OK, maybe the base mini isn't considered a power user's machine but I'm not asking for things out of the ordinary. My Intel based Macs have no issues with adapters, monitors, SSD drives or anything else. They just work... and one is 12 years old. I admire Apple for their attempt to make a totally secure OS but when it creates huge issues for the end user, it becomes counterproductive. This machine has great potential but has to get over the peripheral hump before it is really a bargain. Maybe the next macOS Big Sur update............", [], [640, 641, 3, 644, 261, 263, 519, 137, 138, 266, 656, 17, 403, 404, 661, 23, 152, 280, 282, 545, 419, 37, 556, 304, 308, 183, 56, 184, 448, 321, 322, 587, 333, 334, 461, 463, 470, 347, 220, 351, 226, 100, 357, 612, 103, 104, 613, 234, 621, 112, 241, 626, 627, 246, 120], ["review", 32]], [5.0, 0.8555, "Excellent Mac", "This was a huge upgrade for me coming from a 2012 MacBook Pro. I wanted a desktop computer, but wanted to save some $ and wanted the M1 chip. This latest Mac Mini met both of those for me. My wife thought it was silly to have to buy all the accessories to build around the Mac mini, but that’s what makes this budget friendly and a bit more customizable. The only other Apple product I bought was the apple track pad 2, which I love, especially coming from a MacBook.\nMy whole set up was about $1100: Mac mini, monitor, speakers, camera, mouse, keyboard, monitor stand. That’s way cheaper than buying a top spec Mac. You could also build this cheaper than what I paid depending on what accessories you like/need.\nFor performance, it’s been great! Very smooth. I’m not a video editor or anything like that. I use it for normal, everyday tasks and business. I love the apple ecosystem as I have a iPhone and iPad, and the Mac mini flows perfectly with those.", [0, 1], [3, 135, 137, 11, 15, 17, 18, 21, 23, 27, 34, 35, 163, 48, 177, 60, 192, 71, 202, 206, 81, 209, 94, 100, 111], ["review", 12]], [5.0, 0.0772, "Love the speed, love the size", "My first Apple product was a Apple II and I was on board with the early Mac but business considerations forced me to limp along with ancient Mac products while I delved into the boring PC world. I did have one of the first minis and loved it, even as Apple passed it by with new IOS systems. At 70, I decided to jump into the very latest update replacement of my beloved 2006 mini. As usual, Apple abandons things (ports, CD drives, etc.) for \"simplicities\" sake and tends to be on the pricey side but I have work arounds and I'm pleased with the product and out of probably 15 Apples products I've owned, none have failed me. You don't need the top of the line computers when most of your time is handled by tasks that could be handled by a much older computer. Got a new monitor and a wonderful add-on that allows me to hide the computer behind the monitor, great space saver. If you want a product that should survive in some form until the 2030's, this is it.", [0, 4], [2, 133, 6, 141, 16, 20, 27, 34, 163, 171, 174, 47, 177, 179, 52, 184, 190, 76, 83, 84, 116], ["review", 7]], [5.0, 0.4201, "M1 chip is amazing", "Almost everything I own is part of the Apple ecosystem, from my iPhone to Apple watch to the Apple HomePod, so it only made sense for me to finally replace my aging Windows desktop with an Apple product. I already owned a great monitor and I added the Apple keyboard and mouse to complete the setup. The new M1 chip is great, and the value on these Mac Minis is outstanding. Setup is simple and it works amazingly. Super fast and no noise at all. Highly recommend the Mac mini for anyone looking to purchase a new desktop.", [3], [96, 65, 35, 69, 38, 8, 72, 105, 75, 45, 15, 19, 51, 85, 88, 94], ["review", 5]], [5.0, 0.7096, "Perfect little media box", "When our 2009 Mac Mini (which has been a Linux box for the past year) was unable to reach acceptable wifi download speeds (it was great on ethernet cable, but wifi just doesn't work well) - we decided it was time to retire the little reliable box. This new M1 MacMini works great! It has no problem with our wifi (weak signal) and back to full download speeds! It's sleek, quiet and simple to hook up. Audio plays right through our TV - no more \"remote juggling\" between the TV, Computer and Sound system - Now it's turn on the TV, set to HDMI input, and then surf and run right off the M1 MacMini. Perfect! Amazon delivered quickly and best price I could find.", [0], [64, 97, 3, 4, 69, 7, 39, 136, 91, 138, 110, 142, 20, 21, 59, 28, 62, 63], ["review", 6]], [5.0, 0.3612, "M1 first “system on a chip” technology that beats Intel", "My iMac was 11 years old and unable to upgrade to newer MacOS. Bought the basic entry level model $650 as a trial. Exceptional performance. Older BT mouse & keyboard and Dell graphics monitor are fine. SoC is the future like forerunner iPad pro and iPhones.", [3], [39, 12, 45, 47, 50], ["review", 4]], [5.0, 0.6115, "Best desktop on the market!", "I've owned a desktop computer since IBM released their first PC in 1981. Apple's new M1 Mac Mini is the best computer I've ever owned. It cost me $850 and $1400 for my total system.\n\nThe Mac Mini is completely quiet, lightning fast and compatible with my favorite software, Photoshop & Lightroom. I bought the base model with 8 gig of RAM and a 256 gig SSD. It is more than enough memory and internal storage. I added two Samsung 500 Mbyte SSDs, a T5 and T7. I am very happy with my computer.", [0, 1], [4, 5, 41, 105, 44, 45, 108, 15, 19, 20, 23, 24, 56], ["review", 7]], [5.0, 0.0, "I've officially been converted", "This fits easily on my desk, freeing up a lot of room I previously spent wrestling with a laptop and monitor setup. It is silent, I haven't heard it make a noise since I've received it. I have the base model but it's lightning fast with nary a stutter to be found.\n\nI'm strictly a PC person until I bought this and now I'm not sure how I go back. Things are just intuitive and run fast, and for a compact desktop form factor, I thought the price on this was pretty reasonable considering what you get. I'm sure this won't be new to any person in the Mac ecosystem but was a little bummed not to get a keyboard or mouse with a desktop computer. Will have to add an Apple wireless keyboard at a later time.", [], [1, 2, 7, 104, 75, 140, 141, 113, 148, 55, 124, 93], ["review", 6]], [5.0, 0.3612, "Great entry point for intro to Apple Computers", "I purchased this as a relatively inexpensive way to get an Apple computer as two of my children who are Googlers are Apple only users whereas I have always been a PC user. My experience has been positive and the learning curve short. Each system has its own idiosyncrasies, e.g., the mouse scrolling is opposite. I am very impressed with the hardware. Set up is easy with an internet connection. It works seamlessly with my PC keyboard and mouse (I'm using a KVM to use multiple computers with one monitor and keyboard/mouse). It allows my to sync my iPhone and iPads. It runs Office 365 and comes with an impressive set of its own software. Not ready to replace my PC but can see why my children prefer Apple. Would recommend reviews on YouTube for more details.", [0, 6], [129, 36, 38, 71, 104, 11, 12, 141, 46, 47, 144, 22, 121, 63], ["review", 9]], [5.0, 0.0, "At this level it's the best computer you can get", "This is a deal one can't afford to miss. Apple has produced a quick, seamless desktop experience that enhances your quality of life seamlessly, yet non intrusively. The level of customization is fun. Limited by MacOs? Sure. But that's not the point here at this price point. This is a life and work station.\n\nAnd it's not only a work station, it's a mighty powerful work station. Running 4k video, exporting Logic Pro tracks, play Civ 6 AND running two monitors at this price is frankly the best deal you can get.\n\nI'm a BIG PC fan. Have always had a gaming PC, have one now - guess which one is my main computer? The Mac mini.\n\nI never hear the fan either, and it's much more quickly and intuitive to use.\n\nTo have a Mac that is this powerful, convenient, and compact is amazing. The M1 Chip is the real deal.\n\nMy first ever Mac was a Mac mini, I spent three times what I spent on this base mini and I would dream of performance like this. Seriously.\n\nAlso, if you have an iPhone and AirPods, like I do, the Mac becomes a natural extension of that ecosystem. Apple has always done a tremendous job at this.\n\n10/10.", [6, 7], [134, 9, 137, 11, 12, 144, 18, 161, 37, 165, 39, 41, 43, 172, 185, 188, 205, 78, 208, 211, 91, 223, 228, 231, 104, 237, 238, 115], ["review", 19]], [2.0, 0.2911, "HDMI to DVI is MIA", "Two stars for this terrible out-of-box experience. My brand new Mac mini M1 is not compatible with my old DVI monitor using an HDMI to DVI cable. The monitor just displays an error message, \"Input Signal Out Of Range\".\n\nGood news: A thread on a Mac user support site (latest post January 24, 2021) reports that a software fix will be incorporated in the next system update (OS 11.2).\n\nBad news: I have to wait for delivery of a Thunderbolt to DVI cable before I can even set up the computer to install the OS update.\n\nEdit (February 1, 2021)\n\nI just installed the OS 11.2 system update (4.18 GB, about 1/2 hr to complete).\n\nI'm happy that my HDMI to DVI cable finally works properly and my Thunderbolt ports are free for other duties.\n\nIt will take a while for computers imaged with older versions of OS 11 to flow though the distribution pipeline so be prepared with an alternative to HDMI output if you buy one in the next few weeks.", [4], [34, 4, 104, 11, 75, 45, 139, 82, 52, 181, 54, 154, 124], ["review", 7]], [2.0, 0.0, "Pricey and unreliable", "We purchased the Apple M1 to work on free and open source software.\n\nThe machine is unreliable. We have taken it to Apple twice for repairs. It seems some of the system software has a lot of gaps and some of the system software is not well tested -- the software keeps breaking. So far we've seen the compiler break (the only tool we really use), the account manager break (we can't login to our own machine), and the softwareupdate tool break. In fact, we reported the broken softwareupdate tool to Apple several updates ago and they still have not fixed it.\n\nStorage is also a little on the lean side. We would like to upgrade the SSD but Apple does not let us service it ourselves.\n\nYou should probably wait another year before you buy one of these things. Wait for the product to become more stable. Maybe even buy a used one since they are a bit pricey.", [], [129, 34, 3, 36, 101, 165, 135, 8, 105, 45, 49, 24], ["review", 10]], [3.0, 0.0, "Decent for the price, has limitations, Bluetooth problem", "Good value for the price, but the 8GB RAM is easy to overload, causing slowdowns and freezes sometimes (especially if you have a lot of web browser windows open or use multiple graphics/video apps at once).\n\nThere's also something wrong with Bluetooth, and there was a problem with the HDMI port at first but Apple fixed it with a software update.\n\nIt's almost entirely silent. I had to listen closely to hear it. I wish I hadn't, because I found its particular noise characteristics oddly annoying and now I can't stop hearing it when the room is otherwise completely silent, but it is very quiet.\n\nI wouldn't have even considered buying a computer with only 8GB of RAM but I heard this one works surprisingly well, and it does if you're careful, but you have to go easy on the browser windows and don't run too many intensive apps at a time.\n\nNOTE: You can't upgrade the RAM, which is lame. Also, the SSD is built into the system-on-a-chip, is not easily replaceable, and will eventually stop working. Then what?", [9, 5], [0, 1, 129, 11, 13, 141, 142, 18, 150, 157, 45, 53, 185, 61, 199, 205, 85, 98, 104], ["review", 8]], [1.0, -0.6377, "terrible apple computer 1st and last", "i tried this mini pc its actually bigger and heavier then most mini computers and theres only 2 usbs on this others have 4+.the displays are limited to 2 on a thunderbolts and hdmi port you cannot connect both to the thunderbolt ports and the dual screen options are minimal while in use liek screen stretch is not a proper function.although the processor is fast and the system is quiet its not useful for todays work enviroment with limited display qualities.", [0, 2], [73, 26, 68, 79], ["review", 0]], [1.0, 0.2732, "Still in Beta mode", "NEVER AGAIN WILL I BUY AN APPLE PRODUCT. I got one for Christmas and was the biggest mistake I have ever made buying a PC. Everything the sales staff told me about being able to use an old apple products as monitor or a TV, Apple keyboards, tracking pad and mouse was wrong, they would not work with the mac mini. After multiple calls for intermittent problems I found out from a slip of the tongue that both the Big Sur operating system and the M1 chip have NOT been fully beta tested they are using their customers as beta testers. This is the last Apple product I will ever buy their planned obsolescence is down to 2 to 3 years before your product is no longer what you bought, they remove features and replaced them with an Apple dependent or a long term rental for what was once free.", [], [132, 72, 48, 112, 18, 146, 56, 88, 157], ["review", 4]], [3.0, 0.0, "great hardware, however expect compatibility issues", "I have been using audacity and blue yeti for voice recording. Unfortunately, audacity does not have m1 chip compatible software and blue yeti is a mess for m1 chip. I tested it using my 2013 13\" macbook pro using blue yeti with mac mini with at least 3 different software. Mac mini picking up a lot of background noise even if i set the input to 5%. Searching internet, this is a known issue. Since my main purpose using this is for audio and video editing, i have to return it.\n\nMoreover, this one does not support virtual box to run x86 system. So for developers, who work on cross platform, this is not for you.", [0], [108, 12, 114, 55, 27], ["review", 7]], [3.0, 0.5622, "Get the 16GB RAM if you multitask a lot.", "8GB was not enough RAM for having 20-30 chrome browsers, mail, stocks, excel, photos, notes, TD ameritrade. It would slow down the system every few seconds or so, it was infuriating. I sold this and got the 16GB, MUCH BETTER.", [], [32, 38, 15, 49, 29], ["review", 1]], [1.0, 0.0, "Not For Business Professionals", "I really wanted to like this machine. I spent hours of time researching specs, benchmarks, applicable applications that would would work with and without Rosetta. I read articles, watched YouTube videos and contacted friends fully in the ecosystem to see if this could be a good addition to my collection of computers. After reading, hearing, and watching people give this machine good reviews I pulled the trigger and got it. Was not impressed even in the least.\n\nI knew when buying the machine that I would need to buy a displaylink adapter to get the computer to run 3 screens. I knew when I got it that some had occasional Bluetooth disconnect issues. And I knew that it had limited ports.\n\nWhat disappointed me is that this machine is slow, and ill equipped to handle a business professional work load. I say business professional because many YouTuber’s feel that being in media creation is the the holy grail of a professional work space, when it is not. So a lot of information presented there is heavily biased in that way. I am an accountant, I occasionally dabble into content creation. This machine, for me, was not great at handling my professional needs so it was useless to me.\n\nI got a constant message saying that the unit was low on memory when it wasn’t. I had used 16/256gbs and the ram usage couldn’t have been that high either. I got the message when rendering a 30 minute video in Adobe Premier while on a zoom call with 3 or 4 Safari web pages open. I literally had to close out a few programs so it could focus on only one task because it couldn’t handle it. As an accountant working remotely due to COVID, being on Zoom or Skype is crucial. I cannot have a “work” or “professional” computer unable to handle this load.\n\nI paid roughly $713 for this computer and feel cheated. If you are a business student, professional, or entrepreneur I would strongly advise you to get a windows machine. Yes, the chargers are thick. Yes, they need to be updated. And yes, they aren’t perfect. But this ain’t either. Get yourself a device that can make you money and free yourself time. This device is not that expensive for what it was supposed to be. But do yourself a favor and save your money and get a Dell XPS, HP Envy or Spectre, or a Lenovo. You will spend more money but it will work right out of the box allowing you to make more money than what you spent. It’s an investment piece.\n\nMy advice is don’t get caught up in the hype, the machine is trash. Many people buy the cheapest most crappy windows and hate it because it’s slow, huge, ugly and old. They save a buck or 2 and switch to a mid tier apple machine and think the world of it while no realizing that they have not ever gotten a comparable windows machine. If your budget is rough 750-1000 for a computer and you are thinking of going with Apple because...apple. Think again, and think seriously. Do some real research and avoid people who are followers. Be an independent thinker", [], [2, 131, 4, 135, 391, 398, 145, 530, 533, 407, 413, 541, 543, 548, 38, 169, 432, 50, 568, 195, 69, 454, 456, 589, 463, 81, 210, 466, 597, 220, 350, 607, 229, 614, 488, 105, 364, 367, 243, 382], ["review", 36]]], "user": [4.090909090909091, 0.24344545454545455, [4.0, 0.9116, "Amazing and snappy, but with caveats", "First, the price point for this at $30 under retail was great, but it would have been nice to purchase the 16GB option.\n\nAs a first time macOS user, the setup was quite bumpy. Rosetta seems to work great with certain \"unsupported\" applications, in some cases not expecting it to work at all, and would without any hiccups or noticeable slowness. This was the case with Runelite and enabling the GPU plugin made the experience buttery-smooth on an LG 3440x1440 IPS display.\n\nHowever, Firefox (without installing the beta M1 supported version) would consistently freeze and crash and it seemed to be ruled out by plugins, but even without that, certain websites wouldn't work and loading pages after each click took way too long. I experienced another bug with Discord and couldn't see its login setup screen due to what seemed like a file association or visual glitch, and I found out there's no good uninstaller option natively on macOS other than just binning applications to the trash and clearing it from there. So, I had to uninstaller a third-party app to remove all file associations when the application was installed to finally get a clean install and thankfully the Discord install worked well after that.\n\nThe other downsides for me are general unsupported SOC from various companies/applications, in case I wanted to setup a VM. No eGPU support, and no RAM upgradeability, but that's a given considering the new SOC, just would have been nice to upgrade on our own (and hopefully have made design tweaks to make those upgrades easier for users). Would also have been nice to see a smaller footprint for the enclosure, since it's quite a small SOC based on images I've seen online.\n\nYou may find yourself feeling like a beta tester, it can get pretty frustrating. So consider yourself warned. Hopefully companies release M1 compatible applications soon. Overall, I'm fairly satisfied and hopeful for more application support in the future. Would highly recommend it for more casual users because it seems like it would be an amazing value under that use case.", [0], [257, 382, 387, 388, 13, 147, 20, 275, 283, 32, 160, 292, 44, 301, 46, 174, 48, 175, 316, 190, 330, 331, 339, 340, 345, 218, 347, 221, 223, 226, 103, 360, 362, 108, 237, 110, 366, 373, 246, 254, 377, 252, 126], ["review", 14]], [5.0, 0.4005, "Impressive and so far has lived up to the hype.", "It's fast., quiet, and cool to the touch (I've never heard a fan come on).\n\nI've owned a number of Macs since the original Mac SE and this one has quickly become my favorite. I like the Mini's form factor and its ability to use existing monitors and keyboards. I also find that it's faster, quieter, and cooler than the 2014 Mac mini that I also have in the house. I've also had no compatibility problems with software and hardware. It's successfully driving a LG 34\" Ultrawide monitor at 3440x1440 resolution with a USB-C cable.\n\nOthers have complained about the lack of ports on the Mini, but quite honestly with a USB hub you should be able to connect as many devices you want to the Mini. I have 2 USB hard drives, a USB webcam, a USB microphone, a USB selfie-light and an Apple USB-lightning connector for iPhone/iPad/Apple keyboard. No problems.\n\nThe 8GB RAM/256GB SSD of memory is sufficient for what I do (browsing, MS Word/Excel/Powerpoint), music, video playing, light photo editing and some light development work). I've hooked up an external hard drive so I can offload data that I really don't need to be on the SSD (music and photos).\n\nTwo caveats to anyone that is looking to purchase this (or any Apple Silicon based Mac):\n\n1) Make sure you do not need to run Windows or Linux either through VMWare Fusion/Parallels or Boot Camp. While Rosetta 2 will allow you to use Mac applications that run on Intel Macs, it will not let you run Intel-based Linux or Windows operating systems (either via BootCamp or VMWare Fusion/Parallels). Look to one of the remaining Intel-based Macs if you need this capability.\n2) Get the memory and disk configuration you want at purchase time - especially memory. Neither are user upgradeable. You have a bit more flexibility with storage since the system does have Thunderbolt and USB ports.", [0, 4], [256, 129, 259, 7, 265, 144, 17, 147, 153, 26, 31, 32, 287, 291, 37, 41, 169, 44, 46, 176, 177, 52, 201, 75, 343, 89, 91, 219, 353, 99, 361, 117, 120, 125], ["review", 16]], [5.0, 0.0, "Update: to previous Really mixed issues", "Update: The lower review was for a M1 mini 8gb/256 that ended up with a port problem that was causing issues. Amazon took it back and I ordered this 8gb/512 to replace it. First Apple product in 48 years that I have ever returned and that includes 42 Macs. This one still has the built in limit of 1 monitor per interface... USB and HDMI but I'm only using one on it right now anyway. It will now boot on a Thunderbolt drive where+as the returned unit would not. The ultra high security precautions that Apple has made on the newer machines is somewhat frustrating as frequent code words, passwords and security checks are very common and often interferes with my work flow but that is a little like complaining about having to fasten seat belts. Photo work, especially with M1 ready apps is really a breeze. App launch times and renders are much faster than my 5K 27\" 32 GB/2TB SSD iMac and I find myself moving to this Mac Mini more and more even with the smaller single monitor. So... it went from three stars to a 5 star machine and I almost never give 5 stars to anything.\n\nI have had no issues with this machineAs a Mac user since 1984, this is a difficult review. I have always considered Apple products to be vastly superior to other personal computers on the market and their OS to be unquestionably the best. Well, this Mac mini may change my mind. First of all, if you simply want a computer to browse the internet, send email, etc., it is a speed demon expert at that. If you want other things, like normal dual monitors, external boot drives, etc., then this computer has its issues. Now running OS 11.3, I have no ability to boot from an external Thunderbolt 3 drive. I had that ability with 11.1 but lost it when I upgraded the system. Don't even think about booting from any sort of USB drive. It will NOT work. USB drives of any type (SSD, HD, Thumb) serve as file storage containers... not boot drives. The monitor situation is truly strange. A HDMI and a USB-C monitor will work together but it will not support two HDMI or two USB-C monitors. I finally settled on one HDMI and one VGA (through a USB-C VGA hub). They seem to work well together. I also attempted to use the Luna Display adapter for allowing my iPad Air to be a first or second display. You cannot use the VGA adapter or any type adapter when the Luna adapter is plugged into the USB-C port or the Luna will not work. There are sometimes costs to being early adapters and this seems to be the case with the M1 Mac mini. Though it does read/writes to its custom memory at nearly 3000MBs and loads native software very rapidly, it really just isn't ready for prime time yet for a lot of users. OK, maybe the base mini isn't considered a power user's machine but I'm not asking for things out of the ordinary. My Intel based Macs have no issues with adapters, monitors, SSD drives or anything else. They just work... and one is 12 years old. I admire Apple for their attempt to make a totally secure OS but when it creates huge issues for the end user, it becomes counterproductive. This machine has great potential but has to get over the peripheral hump before it is really a bargain. Maybe the next macOS Big Sur update............", [], [640, 641, 3, 644, 261, 263, 519, 137, 138, 266, 656, 17, 403, 404, 23, 152, 280, 282, 545, 419, 37, 556, 304, 308, 183, 56, 184, 567, 448, 321, 322, 587, 333, 334, 461, 347, 220, 351, 226, 227, 100, 612, 613, 103, 104, 234, 632, 621, 112, 241, 626, 627, 246, 120], ["review", 32]], [5.0, 0.4019, "It Impressed an Apple Hater", "So, I'm now a Mac user. I never used to be. While I admit, Apple has always made some of the best hardware on the market, I've never liked their business practices, or their software.\n\nThat said, I needed a Mac for software development anyway. I was considering buying one used. A decent used Intel Mac Mini is about $500, so I figured I'd check out the new M1 for $700. Besides, I got a tickle out of the idea of a modern ARM core potentially rivaling X86. So, why not give it a shot.\n\nFolks, this 45 year old PC nerd is blown away. This machine will do anything I need it to do, without even spinning up the fan. You might not be happy with trying to edit 8k video on it, and it's not a gaming rig by any means. But bang for the buck, the Mini M1 is the best deal I've ever seen.\n\nI'm excited to see what the future holds for Apple Silicon. It was definitely the right move, and everyone should buy one of these things.", [1, 3, 4], [6, 7, 144, 17, 19, 20, 150, 26, 35, 166, 50, 178, 182, 191, 67, 68, 199, 204, 123], ["review", 13]], [4.0, 0.9627, "IMPRESSIVE from the start", "It's exciting to see a company I saw as the 2nd to PCs and 2nd to Android put out a product that challenges both at the same time! \"They\" say not to by a first gen product but I had to see this for myself. It operates smooth and you would never suspect the level of performace out of what is essentially a single board computer. Apple basically just dominated the PC, cell phone, and single board computers in one go. Now I didn't say it had the most powerful PC chip, I'm saying the benchmarks put it at the top for the modern desktops and at under $700 I'm impressed. I still want to do some testing to see how it does. So why 4 stars instead of 5. 1st The obvious is the full size mac mini with no upgradable parts YET hey, I take this one as an intro unit for the future and would like to see at least an upgradable \"nvme/ssd\" in the next one I buy (yeah this is my second mac mini and I like the mini computers) 2nd after seeing YouTube tear downs I'd like to see this in a much smaller format; maybe half the size or if the same size then upgradable ram, ssd, etc... (tbh I don't always have the money to buy what I want fully loaded) 3rd... this is a risc type machine with neural engine, I would really like to see that 40 pin arduino interface to make this more than just a computer but a STEM -> STEAM -> STREAM device where schools or individuals can use it to write about the project, develop the project, and control external sensors and be makers. Seem like this might be something that could fit into a maker lab and be used for publishing and connectivity. But yeah if you are a mac user then this should be great and yes even though I'm more of a Linux and Windows user, the competition is really helping move the digital world forward and hopefully Intel will step up their game", [0], [128, 384, 2, 274, 23, 157, 289, 176, 57, 193, 70, 326, 72, 202, 333, 215, 347, 353, 99, 358, 360, 112, 371, 377, 124, 255], ["review", 9]], [5.0, 0.0, "Excellent purchase with one caveat", "This is a great little computer. Great for the price, compact, fast, lots of options. I only had one problem and this was kind of serious. When I sync my iPhone with it to upload music, it breaks all of the third-party apps. It did this with two iPhones. It was a miserable problem and it took me a while to figure out what was really going on. Apple should be more upfront about this. If this is an important feature to you you might wanna reconsider the purchase. But otherwise this is an excellent purchase that exceeded my expectations. I should also add that I have been a Mac mini user since 2012 and have three of them around the house besides this new one.", [0], [3, 5, 7, 107, 78, 125, 24, 62, 90, 123, 28, 61, 30], ["review", 9]], [5.0, 0.0, "Get a Mac Mini", "Covid made me realize that laptops are overrated. Since working from home, I was constantly bothered by my dated Macbook pro (2013 model) fan whenever Zoom is on. Everything seems a little laggy and the fan noise became an annoyance.\n\nGetting the Mac Mini in January 2021 proved to be one of the best decision I've made. I can't speak for video and photograph editors but for a regular user (basic streaming+work doc), Mac mini is more than sufficient.This machine is SILENT and often I forgotten about its existence. In my non professional opinion, this product is a steal for the price. ($200 cheaper than the Air and $400 cheaper than the Macbook pro)", [2, 3], [97, 40, 59, 44, 78, 48, 17, 49, 112, 85, 27], ["review", 6]], [4.0, 0.2382, "Good quality, and consistency across products", "The fact that is no user upgradable, is a big turn off. i bought my first apple a macbook pro in 2012 it was extremely slow, until after i installed more memory and swap the hard drive for ssd. Now apple decided to make this machines not user upgradable, if you need more memory or a bigger hard drive you have to pay more than double what you will spend making the upgrade your self, and you have to decide it at the time of purchase. Greed I suppose. Any way the M1 chip on this machine is a big improvement in speed, and so far I am very please with it. And something else, for the initial set up is better if you have a wired keyboard available, it can be done with a wireless keyboard but you will have to Google it to find the instructions because Apple doesn't include a guide on how to do it.", [0], [161, 67, 4, 5, 38, 132, 108, 51, 118, 93, 62], ["review", 5]], [5.0, 0.7783, "Simple, quiet, powerful", "I read a lot of reviews praising this new Apple M1 chip, but I have always been a little suspicious. With only 8GB of RAM, I thought I would be a little disappointed, but I am wrong. This machine handles everything quickly, and the fan has never come on once. I could not be more impressed with the performance. I use Adobe CC (not a power user), and do some fairly basic video processing. Super pleased!", [4], [35, 6, 40, 9, 75, 50, 51, 20, 86, 87, 62], ["review", 5]], [5.0, 0.3612, "Great entry point for intro to Apple Computers", "I purchased this as a relatively inexpensive way to get an Apple computer as two of my children who are Googlers are Apple only users whereas I have always been a PC user. My experience has been positive and the learning curve short. Each system has its own idiosyncrasies, e.g., the mouse scrolling is opposite. I am very impressed with the hardware. Set up is easy with an internet connection. It works seamlessly with my PC keyboard and mouse (I'm using a KVM to use multiple computers with one monitor and keyboard/mouse). It allows my to sync my iPhone and iPads. It runs Office 365 and comes with an impressive set of its own software. Not ready to replace my PC but can see why my children prefer Apple. Would recommend reviews on YouTube for more details.", [0, 6], [32, 129, 36, 38, 71, 104, 11, 12, 141, 47, 144, 22, 121, 63], ["review", 9]], [5.0, 0.5129, "The Fastest Computer I have Ever Used", "I have been a Mac user for over 20 years. I replaced a very old iMac (13years old) with the new M1 Chip Mac Mini. This is the fastest computer I have ever used. I would recommend it without hesitation.", [], [33, 4, 5, 41, 44, 26, 27], ["review", 3]], [5.0, -0.2732, "Mini and Mighty", "The M1 chip in this Mac Mini is fast and efficient, the fan is super quiet and the machine powers on super fast. I have not encountered the Bluetooth issues that have plagued some users, here’s hoping that Apple has found a permanent solution for said Bluetooth issues. The Mac Mini is smooth, easy to use, and efficient for all day to day tasks. Don’t hesitate to try it out for yourself.", [0], [65, 5, 6, 41, 10, 43, 44, 13, 76, 15, 48, 22, 55, 56, 60], ["review", 3]], [5.0, 0.2263, "updated computer", "I had an older Mac mini and updated when I saw the new processors from Apple. This version is even better than the one I have been using for years. VERY fast and can handle so much more than previous model. Great computer for those of us that are not high end users (gamers, video editing, graphics, etc.). Although I wouldn't be surprised if it could handle some of that also.", [1], [4, 72, 44, 45, 15, 21], ["review", 4]], [5.0, 0.0, "Awesome. Finally a solid step ahead for Mac desktops.", "I've been a Mac user since the late 90's. Bough this M1 mini to replace an aging 2014 mini that was struggling to process videos in FCPX. It is a very smooth and fast machine. I've got the 8Gb version and it processes video edits pretty much instantaneously. Sharing of completed files is a fraction of the time it used to take. I've done several projects on it now and not had ANY issues with it. I also use it with Reason audio software and it has no troubles with that.\n\nThe 256Gb SSD is not very big so I've paired mine with a 512Gb external SSD. I store data on the 512 and apps on the 256. Working out great.\n\nONE WARNING: Apple has taken away the SD card slot (disappointing). You'll probably need a USB hub as two USB-a and 2 USB-c slots aren't much.", [0, 8, 4], [96, 97, 98, 4, 5, 134, 137, 139, 140, 51, 148, 55, 24], ["review", 11]], [5.0, -0.4201, "If you're converting from Windows, be patient and learn the machine!", "This is my first time ever using Apple products for personal use and I got tired of windows. This doesn't include a mouse or keyboard, so you'll have to purchase a licensed magic mouse to boot the machine. After that, I'd recommend you switching to a logitech mouse, for easier navigation and getting a numeric pad keyboard. So far, this has been an amazing machine, with speed (16gb ram) and handling everything you're running. I highly doubt I'll ever go back to Windows, which I've been a longtime user for over 20 years.", [], [70, 7, 73, 106, 15, 48, 57, 91], ["review", 4]], [3.0, 0.0, "Wait a bit if you want to return it because of hangover. Bluetooth issues !", "Keep in mind it needs some time\nLike a one-week to download all updates.\nFirst, it’s hungover on iMovies\nAnd I think to return it,\nLater it received updates and has no more problems with videos.\n\nBut-terrible problems with Bluetooth started.\nIt's hard to believe it's an Apple product, not the underground manufacture of Somalia.\nSpent two more days, I bring it to the Apple store.\nThey agree to do warranty,\nBut not right away, still need to wait a few days.\nI disagreed to wait a few days, and obtain a wired Apple keyboard.\n\nMac Mini's Bluetooth keyboard disconnection is a strange problem.\nStill, nobody knows the best way to fix it.\nOur old Magic keyboard is still working fine with all other macs in our home,\nbut can't be distinguished by the new mac mini.\nIt works fine right to the 3rd update.\n\nWhen I turned on a new Apple keyboard, it also wasn't recognized.\nBut after connected by cable, it starts to be seen, and later, after the cable was disconnected,\nit continued to works fine.\n\nSo, that is so strange, Apple store thinks they need to change the motherboard.\n(Without even testing the mac mini)\nI like Apple and I have no other choice but to use their products.\nCan't imagine the nightmare to become a Windows user again.", [5], [129, 262, 7, 142, 35, 36, 164, 38, 43, 177, 50, 56, 76, 80, 211, 218, 220, 99, 110, 239, 240, 113, 114, 244, 121, 122], ["review", 15]], [2.0, 0.2911, "HDMI to DVI is MIA", "Two stars for this terrible out-of-box experience. My brand new Mac mini M1 is not compatible with my old DVI monitor using an HDMI to DVI cable. The monitor just displays an error message, \"Input Signal Out Of Range\".\n\nGood news: A thread on a Mac user support site (latest post January 24, 2021) reports that a software fix will be incorporated in the next system update (OS 11.2).\n\nBad news: I have to wait for delivery of a Thunderbolt to DVI cable before I can even set up the computer to install the OS update.\n\nEdit (February 1, 2021)\n\nI just installed the OS 11.2 system update (4.18 GB, about 1/2 hr to complete).\n\nI'm happy that my HDMI to DVI cable finally works properly and my Thunderbolt ports are free for other duties.\n\nIt will take a while for computers imaged with older versions of OS 11 to flow though the distribution pipeline so be prepared with an alternative to HDMI output if you buy one in the next few weeks.", [4], [34, 4, 104, 11, 139, 45, 82, 52, 53, 54, 181, 154], ["review", 7]], [3.0, -0.6124, "My Stupidity? Deficient Apple Instructions? Some Combination? -- You Decide", "I bought 3 of these things and returned 2 before I finally figured out what was going on. My initial assessment was that they were all DOA and wouldn't boot.\n\nWhen I plugged the box in and hooked it up to the monitor I expected to see the display from a Mac that had booted into the Mac user interface. Instead all I got was a puzzling image of what looked like a mouse, alternating with a keyboard. Since the MacMini has excellent Bluetooth I expected to be able to use my BT mouse and / keyboard to supply whatever input is needed.\n\nSilly, silly me. In fact you need to attached a wired input device (mouse or keyboard) to get it to complete the boot sequence and start asking the user ID questions. Without the wired input device it remains a dumb piece of silicon, plastic and aluminum capable of little more than lighting up a monitor.\n\nI finally went out to CVS (who uses a wired mouse these days?) and purchased a cheap mouse that attaches to MacMini USB port. Then it completed the boot sequence and everything (included BT & Wifi) started working swimmingly.\n\nSo how good is the computer? I haven't really had a chance to check it out yet. All I can say is that I have no reason to doubt the rave reviews all the M1 Macs have received from. people far better equipped to evaluate than I.\n\nBut if you do purchase this machine, make damn sure you have a wired mouse.\n\nAnd that 3 star review is just a compromise between the 0 stars I'd give to for the weeks long struggle to boot the damn thing, and my relatively brief experience since I've had it up and running.", [1, 4], [263, 142, 279, 280, 154, 27, 162, 308, 54, 312, 60, 61, 75, 87, 88, 220, 223, 231, 110, 112, 246, 249], ["review", 16]], [3.0, 0.765, "Great computer, EXCEPT that it doesn’t work with my monitor", "I like the computer. Bought it mid-April, 2021 and posted this 10-days later on Apple forum:\n\n“Immediately after Mac Mini M1 Big Sur 11.4 update, Sceptre C27 monitor began going to black screen. Restarting monitor restores normal function momentarily before it goes black again and monitor cycles black and normal randomly. C27 works normally with Dell desktop and Acer display works fine with Mac Mini. Tried different DVD cables and power supply, same results.”\n\nAs of June 20, eleven other forum users have indicated the same issue, but Apple support hasn’t responded.\n\nUnless you are ok with accepting a crap-shoot on whether your chosen monitor will work with your great new computer, I suggest you wait until Apple support gets around to addressing this Big Sur OS flaw.", [0, 1], [1, 3, 68, 100, 70, 71, 101, 41, 133, 134, 110, 16, 112, 22, 23, 124, 126, 63], ["review", 5]], [3.0, 0.4404, "Hardware is good. Software is subpar.", "It’s a computer. And as a device it is just fine. Not a fan of quirkiness of Mac OS. Being used to GNU/Linux environment Mac OS seems less user friendly, less finished, than Ubuntu or Mint, for example. If you’re used to Mac OS, then you’ll be right at home. If you love iPhone and are wondering if Mac OS is just as great, well, it is not. Get a Linux based computer instead. It will serve you better.", [2], [33, 34, 67, 4, 97, 73, 13, 78, 80, 17, 21, 53, 90, 29], ["review", 6]], [1.0, -0.4767, "Half Baked", "My 8GB Mini was plagued with problems right out of the box. Random pink screen when booting and flashing green/pink horizontal artifacts when using the desktop environment. Kernal crashes at the App Store when applying updates. Then after wiping the OS I get errors when creating a user account regardless if I use iCloud or not. This is a terrible user experience coming from Apple. It feels like I’m using a Linux box with outdated drivers. Never have I been so frustrated with a new Apple product. Note: this isn’t happening to everyone, but there are a bunch of similar experiences popping up on message boards. Some say it's a Big Sur/hardware driver issue, but whatever it is, it's rushed. Apple blew it with the cheapest entry to their M1. What a shame.", [], [64, 2, 68, 6, 72, 139, 46, 48, 50, 152, 89, 26, 93, 30, 63], ["review", 10]], [3.0, 0.8481, "Not quite ready for prime time", "I've owned Macs since their Powerbook 100 released 29 years ago, and before that, PCs running DOS and CP/M, in addition to dozens of Macs over the years. I recently sold my Mac Pro and matching Pro Display (add them up: $12,000), and just sold both: I figured Apple would migrate to a new, proprietary chip, and they have done so. And when I heard through the rumor vine that they were going to issue one, and possibly two, Mac Pros (one is reportedly half the size of the current monster, and the other will be same-sized), plus a less expensive, consumer-oriented display, I figured it was the time to get an interim Mac computer to hold me over for a year or two.\n\nI bought the Mac Mini with the M1 chip and 8GB of memory, with the Apple-sponsored LG monitor (Ultrafine display, 5K), and assumed it'd be clear sailing.\n\nIt wasn't.\n\nThe first problem is that, no matter what anyone tells you, you're better off getting the 16GB of memory, because otherwise you'll be swapping memory constantly, with three or more programs open, and using software to clear the RAM. The second problem is a software glitch or hardware glitch in the graphics processor that causes jagged lines of text! This is a random issue, which makes it even more frustrating, because it can't be isolated and resolved by the user. The third problem is that you cannot hook up two Apple-sponsored LG monitors to it (the 5K and the 4K), which is what I wanted to do. In fact, if you want to hook up two monitors, it MAY be possible, but Apple users online are reporting difficulty in doing so. (Your mileage will vary.)\n\nBottom line: I'd skip the Mac mini M1 and wait for them to come out with an iMac with the M1 chip. Then you'll be able to add the memory you need, have a beautiful screen, and possibly a new classy chassis because the rumor is that the iMac for 2021 will be redesigned and resemble the Apple DXR display: the iMac hasn't changed its basic look in, oh, years.\n\nApple makes great products. But the Mac mini M1 has flaws that may make you wish you had waited for a new, improved model. It's good value for the money, to be sure, but the iMacs have proven to be more reliable, and of course, the latest Mac Pro I had (which was more power than I needed, which is why I sold it) was a real workhorse, and a showpiece: I'll happily buy the forthcoming Mac Pro with the M1 chip when it's announced.", [2], [384, 512, 516, 135, 136, 264, 391, 271, 273, 276, 150, 151, 280, 408, 414, 37, 426, 428, 433, 178, 306, 436, 442, 187, 59, 315, 191, 192, 450, 455, 200, 328, 456, 333, 463, 95, 352, 481, 228, 234], ["review", 15]]], "devices": [3.2142857142857144, 0.22909285714285715, [5.0, 0.4005, "Impressive and so far has lived up to the hype.", "It's fast., quiet, and cool to the touch (I've never heard a fan come on).\n\nI've owned a number of Macs since the original Mac SE and this one has quickly become my favorite. I like the Mini's form factor and its ability to use existing monitors and keyboards. I also find that it's faster, quieter, and cooler than the 2014 Mac mini that I also have in the house. I've also had no compatibility problems with software and hardware. It's successfully driving a LG 34\" Ultrawide monitor at 3440x1440 resolution with a USB-C cable.\n\nOthers have complained about the lack of ports on the Mini, but quite honestly with a USB hub you should be able to connect as many devices you want to the Mini. I have 2 USB hard drives, a USB webcam, a USB microphone, a USB selfie-light and an Apple USB-lightning connector for iPhone/iPad/Apple keyboard. No problems.\n\nThe 8GB RAM/256GB SSD of memory is sufficient for what I do (browsing, MS Word/Excel/Powerpoint), music, video playing, light photo editing and some light development work). I've hooked up an external hard drive so I can offload data that I really don't need to be on the SSD (music and photos).\n\nTwo caveats to anyone that is looking to purchase this (or any Apple Silicon based Mac):\n\n1) Make sure you do not need to run Windows or Linux either through VMWare Fusion/Parallels or Boot Camp. While Rosetta 2 will allow you to use Mac applications that run on Intel Macs, it will not let you run Intel-based Linux or Windows operating systems (either via BootCamp or VMWare Fusion/Parallels). Look to one of the remaining Intel-based Macs if you need this capability.\n2) Get the memory and disk configuration you want at purchase time - especially memory. Neither are user upgradeable. You have a bit more flexibility with storage since the system does have Thunderbolt and USB ports.", [0, 4], [256, 129, 259, 7, 265, 142, 144, 17, 147, 153, 26, 31, 32, 287, 291, 37, 41, 169, 44, 46, 176, 177, 52, 201, 75, 343, 89, 91, 219, 99, 361, 117, 120, 125], ["review", 16]], [5.0, 0.6249, "What's not to love?", "To hook it up to my particular 4K monitor, I bought one of each possible cord: a Thunderbolt 3 to DisplayPort cable, and also an HDMI 2.0 cable. Both work great, but I believe I see a slightly higher quality picture using the Thunderbolt-to-DisplayPort. I can only imagine what the picture quality must be like for people with Thunderbolt monitors! Heads up that if you have Firewire 800 devices, buy the Thunderbolt-to-Firewire adapter. If you have Firewire 400 devices, yet another adapter. And you will likely need a USB 3.0 hub, because only two USB slots are provided. Great news, there IS a headphone jack.", [4], [96, 34, 75, 111, 87, 60], ["review", 6]], [5.0, 0.7086, "now I'm a believer", "I got this for logic PRO and messing around recording music. Up and running in 10 minutes. My devices were recognized and usable immediately without driver hunting. (And one of the devices is 15 years old!). Audio routing was intuitive and easy. I don't want to be another Apple fanboy but my first day with this entry level mac product has been very exciting !", [], [35, 69, 7, 72, 48, 20, 53, 57], ["review", 5]], [5.0, 0.0, "M1 Mac mini", "I lost 2 iMacs last year during a powerful thunderstorm and needed to replace them. This little machine has handled everything I have worked on. The photo I uploaded shows the Arsenal match playing on part of the screen and something I was working on in another. The machine is virtually silent and takes up very little space on my desk. There are enough ports for all of my devices and it works with all of the other computers on my network.", [1], [1, 35, 8, 73, 19], ["review", 4]], [5.0, 0.4754, "Nice for everybody but especially for seniors", "Great product\nAllows for variety of devices and is very fast. I have used the mac since 2009 but the mac mini is real leap in performance. I have a 32 inch tv attached for the monitor very nice for this old man.", [0], [0, 2, 40, 6], ["review", 2]], [5.0, -0.296, "Perfect as usual", "Ideal for what our family needed this for and works just like we needed it to. No bloatware, privacy mechanisms for family use and very intuitive for all of our families mobile devices.", [0], [0, 17, 34, 11], ["review", 1]], [3.0, 0.6757, "Runs good, but there were some buggy issues Apple needs to figure out.", "After all the reviews, I expected the \"bomb\" but got fluff instead. Buggy wifi and bluetooth, errant failures on apps, slow copying from external devices, and sudden thermal highs and low when no apps were running. After a couple of weeks and a update it runs better, and is good for web browsing, music, playing low end games but it is NOT a gaming machine, and never was meant to be. It is a definite step up to the older macs, but still needs a-lot of improvement.", [1, 9], [65, 66, 100, 37, 39, 9, 22, 54, 87, 58, 30], ["review", 2]], [1.0, 0.0, "Expensive Brick", "Data would not transfer with the migration assistant. It was at 0 files for hours. Finally I quit the process. Then it bombed. I just have the exclamation point. Can’t even get to startup options.\n\nYes, there are many things to try - using a USB C to USB A cable that is both power and data. There is also using the app Apple Configurator 2, which did not see any of my devices because you have to configure your network a certain way. There is also calling customer service (lol). Why do all these things? If it might need a cable, or works better to migrate with one, just give us a cable, Apple. I want something to work without a lot of fuss.\n\nI've heard great things about the M1 Mac Mini. But I'll wait for the M1 iMac.", [], [121, 133, 103, 136, 73, 43, 84, 149, 25, 154, 155, 93], ["review", 13]], [2.0, 0.0, "Relying on Bluetooth? Then you need to wait...", "Great machine for a great price. However, if you use ANY bluetooth devices...specifically Apple's Magic Keyboard and Airpods Pro - be ready for them to connect and disconnect continually. Enough that I have now had to buy a wired keyboard. Extremely frustrating. Even their own products are not working via Bluetooth with the M1.", [2], [0, 4, 58, 14, 48, 17, 26], ["review", 3]], [3.0, 0.8126, "Want to become a beta tester?", "Like many others suggest — be warned. You’re going to feel like a beta tester. I’ve run into nothing but problem after problem that I’ve had to troubleshoot from faulty Bluetooth connection, strange bugs with audio devices, display problems and issues with latency...the list goes on. I’m happy to get this device at a relatively reasonable price, but it will be a while before it’s perfected.", [0], [0, 35, 37, 6, 38, 41, 45, 14, 48, 83, 26, 28, 62], ["review", 3]], [1.0, 0.0, "Piece of junk", "This is my fourth Apple devices and I’ve never had so many problems with my previous ones. It didn’t meet my expectations", [], [4, 5, 14], ["review", 1]], [1.0, 0.0, "Lacks plugin and features for professional use.", "So what is everyone doing? This lacks the backside connections for professional use, not enough for my old devices that are not going to be replaced, thus not particularly useful for video & photo edit. Has Mac gone elitist? Not for the rest of us?\n\nIs it back to Windows or what? Comments?\n\nI can't buy until more connections are placed on and software is updated for M1.", [0], [32, 39, 40, 7, 20], ["review", 6]], [2.0, 0.0772, "Bluetooth does not work", "The bluetooth doe not work. I️ am not sure if this is a software or hardware problem. My apple keyboard and apple mouse disconnect at least once every hour. I️ have contacted apple support and they could not fix the issue. They told me it was probably due to interference from my microwave (which is not in the same room as my computer and has not affected bluetooth on any other devices).\n\nTLDR; do not buy if you want to use with bluetooth devices (airpods, wireless mouse, wireless keyboard)", [0], [67, 36, 69, 71, 9, 76, 17, 86, 91], ["review", 5]], [2.0, -0.2716, "Bluetooth failure still not fixed", "Unfixed Bluetooth problems with wireless devices (mouse/keyboard) remain a big reason not to buy this otherwise useful device. For some time, I thought the problem was my devices, but google searches recently revealed that in fact the problems are common. Amazon will not allow the posting of links, but stories dating back to early 2021 are easily found by googling \"mac mini\" and \"chip\" and bluetooth. Some days, four or more failures occur and require a reboot to restore connectivity.", [0, 1], [1, 2, 5, 42, 46, 49, 18, 84, 91, 28, 63, 31], ["review", 3]]], "graphics": [4.2727272727272725, 0.3619909090909091, [5.0, -0.0772, "Wow, those graphics!", "I bought this Mac mini to replace a 2018 refurb. While the 2018 was good—much much faster than my old 2012—the base configuration with integrated graphics wasn’t able to keep up with my new obsession with FPV simulator games like DRL Sim and Velociraptor.\n\nThe new M1 Mini is screamingly fast in its base configuration, booting up Big Sur in about 10 seconds. And it runs my simulation games at crazy fast frame rates with details that the old machine could only dream about.\n\nMinuses: no way to upgrade the RAM, so it gets easily bogged down by memory hogs (Google Chrome, looking in your direction) or by serious multitasking. There are also some hiccups with older Intel apps, and I’m not quite sold on Big Sur. Other than that, I’m sold. This is as close to a serious gaming machine as you’ll get from Apple without shelling out for discrete graphics.", [0, 3], [3, 37, 103, 168, 42, 76, 174, 51, 88, 26, 120, 93, 159], ["review", 7]], [5.0, 0.3612, "M1 first “system on a chip” technology that beats Intel", "My iMac was 11 years old and unable to upgrade to newer MacOS. Bought the basic entry level model $650 as a trial. Exceptional performance. Older BT mouse & keyboard and Dell graphics monitor are fine. SoC is the future like forerunner iPad pro and iPhones.", [], [36, 45, 39], ["review", 4]], [5.0, 0.5574, "The hype was right", "This thing is fast. I bought the base model, and it's one of the fastest PCs I've ever owned. Obviously, there are people out there trying to use this for professional video production work etc., and they seem surprised that it doesn't always handle it as well as a multi-thousand desktop PC with a dedicated top-tier graphics card. I'd refer them to the quote from the animated film \"Up\", \"but it's a talking dog!\" For what it is, this is remarkable and just wait for the M1X...", [], [64, 98, 45, 54, 58, 62], ["review", 4]], [5.0, 0.2263, "updated computer", "I had an older Mac mini and updated when I saw the new processors from Apple. This version is even better than the one I have been using for years. VERY fast and can handle so much more than previous model. Great computer for those of us that are not high end users (gamers, video editing, graphics, etc.). Although I wouldn't be surprised if it could handle some of that also.", [1], [4, 72, 44, 45, 15, 21, 62], ["review", 4]], [5.0, 0.4404, "All the advantages of MACOS in a small package", "Most striking is the opening screen that demonstrates the capability of the chip and Big Sur OS. The possibilities for your project are limitless. Audio, graphics, and visual display are as good as your equipment can handle.", [2, 7], [1, 35, 28], ["review", 2]], [5.0, -0.4019, "Simply amazing", "The M1 is a game-changer. This thing's performance gives my 2019 16\" MacBook Pro with top-of the line specs (Intel i9 processor and AMD Radeon Pro graphics) a run for its money at about a quarter of the cost. Almost comical the circles this runs around my previous Mac mini. Simply insane.", [1], [54, 58, 30], ["review", 3]], [5.0, 0.7783, "Most quiet Mac I've used", "Can't say anything negative about this Mac Mini M1. I purchased the base model, 8GB + 256GB SSD. Works well for my use cases at home. Super quiet and very fast and snappy graphics. Definitely a great product from Apple.", [2], [4, 38, 7, 8, 40, 42, 45, 23, 31], ["review", 4]], [5.0, 0.6124, "Apple has raised the bar.", "My Mac Mini M1 (2tb storage, 16gb RAM) replaces a nearly 14 year old iMac. That reliability alone, told me it was a no-brainer to get this new Mac. It’s extremely fast. The graphics are amazing (bought a 4K monitor). My old wired Apple keyboard, and AA battery powered trackpad connected perfectly with zero issues. The technology inside this Mac is unlike anything out there. I went to an electronics big box store to test drive an M1 powered Mac. My 15 minute experience was enough to sell me. I recommend you try this out. You might be pleasantly surprised.", [0, 1], [64, 1, 2, 33, 73, 42, 107, 44, 116, 21, 117, 55, 94], ["review", 8]], [3.0, 0.0, "Decent for the price, has limitations, Bluetooth problem", "Good value for the price, but the 8GB RAM is easy to overload, causing slowdowns and freezes sometimes (especially if you have a lot of web browser windows open or use multiple graphics/video apps at once).\n\nThere's also something wrong with Bluetooth, and there was a problem with the HDMI port at first but Apple fixed it with a software update.\n\nIt's almost entirely silent. I had to listen closely to hear it. I wish I hadn't, because I found its particular noise characteristics oddly annoying and now I can't stop hearing it when the room is otherwise completely silent, but it is very quiet.\n\nI wouldn't have even considered buying a computer with only 8GB of RAM but I heard this one works surprisingly well, and it does if you're careful, but you have to go easy on the browser windows and don't run too many intensive apps at a time.\n\nNOTE: You can't upgrade the RAM, which is lame. Also, the SSD is built into the system-on-a-chip, is not easily replaceable, and will eventually stop working. Then what?", [9, 5], [0, 1, 129, 11, 13, 141, 142, 18, 150, 157, 45, 53, 185, 61, 199, 205, 85, 98, 104], ["review", 8]], [1.0, 0.6369, "Total Disappointment", "I was excited to try the M1 Mac, but then the problems started. There is a major issue with the M1 chips and the graphics connection. The computer constantly drops the second monitor connection. After the computer goes to sleep, you have to unplug and re-plug in the monitor cable, to get the display working again. This happens several times a day. Apple has acknowledged this problem in England, but has not done so in the US.\n\nBig Sur 11.2, which was supposed to fix the problem, actually made it worse and can completely block the use of a second monitor by not recognizing it’s connected. Big Sur 11.3 was also supposed to fix the issue too, but again, Apple did not resolve the problem. Since two updates have been unable to resolve the issue with the M1 chip and external displays, and this issue occurs with all M1 computers, it makes one wonder if the issue is with the design of their new M1 chip, and not something that can be easily fixed.\n\nAfter 3 weeks of using the M1 Mac Mini it started causing static/snow on one of my monitors while the Mini would make a horrible squeal. This only happens on the monitor connected via the HDMI socket, and lasts for 5-10 seconds before the desktop appeared. After that started happening, it was clear this M1 Mini would never last, and I decided to return the item.\n\nApple used to be the best computer company on the planet. Now, they're just like everyone else, but overcharging for their poorly designed products. I've used Apple products for decades, without issue. I was happy to pay more for high quality products that were, generally, issue-free. I've now had a problem with the last 4 Apple products I've purchased. The days of Apple being the best in the market are long gone.", [1], [2, 7, 136, 139, 12, 141, 268, 273, 274, 150, 26, 285, 30, 32, 40, 300, 310, 312, 193, 70, 71, 74, 203, 204, 330, 79, 335, 216, 344, 347, 220, 97, 102, 106, 242, 252, 255], ["review", 17]], [3.0, 0.8481, "Not quite ready for prime time", "I've owned Macs since their Powerbook 100 released 29 years ago, and before that, PCs running DOS and CP/M, in addition to dozens of Macs over the years. I recently sold my Mac Pro and matching Pro Display (add them up: $12,000), and just sold both: I figured Apple would migrate to a new, proprietary chip, and they have done so. And when I heard through the rumor vine that they were going to issue one, and possibly two, Mac Pros (one is reportedly half the size of the current monster, and the other will be same-sized), plus a less expensive, consumer-oriented display, I figured it was the time to get an interim Mac computer to hold me over for a year or two.\n\nI bought the Mac Mini with the M1 chip and 8GB of memory, with the Apple-sponsored LG monitor (Ultrafine display, 5K), and assumed it'd be clear sailing.\n\nIt wasn't.\n\nThe first problem is that, no matter what anyone tells you, you're better off getting the 16GB of memory, because otherwise you'll be swapping memory constantly, with three or more programs open, and using software to clear the RAM. The second problem is a software glitch or hardware glitch in the graphics processor that causes jagged lines of text! This is a random issue, which makes it even more frustrating, because it can't be isolated and resolved by the user. The third problem is that you cannot hook up two Apple-sponsored LG monitors to it (the 5K and the 4K), which is what I wanted to do. In fact, if you want to hook up two monitors, it MAY be possible, but Apple users online are reporting difficulty in doing so. (Your mileage will vary.)\n\nBottom line: I'd skip the Mac mini M1 and wait for them to come out with an iMac with the M1 chip. Then you'll be able to add the memory you need, have a beautiful screen, and possibly a new classy chassis because the rumor is that the iMac for 2021 will be redesigned and resemble the Apple DXR display: the iMac hasn't changed its basic look in, oh, years.\n\nApple makes great products. But the Mac mini M1 has flaws that may make you wish you had waited for a new, improved model. It's good value for the money, to be sure, but the iMacs have proven to be more reliable, and of course, the latest Mac Pro I had (which was more power than I needed, which is why I sold it) was a real workhorse, and a showpiece: I'll happily buy the forthcoming Mac Pro with the M1 chip when it's announced.", [2], [384, 512, 516, 135, 136, 264, 391, 271, 273, 150, 151, 280, 408, 414, 37, 426, 428, 433, 178, 306, 436, 442, 187, 59, 315, 191, 192, 450, 455, 200, 328, 456, 333, 463, 95, 352, 481, 228, 234, 244], ["review", 15]]], "Noise level": [3.5, 0.23087500000000002, [5.0, 0.743, "Way better than I could have imagined", "It’s pretty incredible just how efficient and powerful this new M1 processor is. I can compile and run Java code _literally_ 10x faster than with my previous 2019 16” i7 MBP. A Spring app that previously took 24 seconds to compile now takes 2 seconds. Gains of this magnitude are not normal, given Moore’s Law.\n\nAlso, I know this has a fan in it, but I have pushed all cores to 100% while driving a 4K monitor and a 1080p monitor, and put my ear right next to it, and I cannot hear a thing. My MBP would get so loud I thought it was going to blow out a fan motor.\n\nThe only draw I see for this machine is its video out limitations. You can only run one video signal via the HDMI channel, and one via both Thunderbolt ports. No combo of the two, so my Caldigit TS3+ can no longer simultaneously drive my 4K DisplayPort monitor AND my 1080p hdmi monitor - I have to run one from the mini’s HDMI port, and the other from the Thunderbolt port. It sucks, but it’s not a dealbreaker.\n\nAlso, I researched wide online to see if anyone could find a current need for the 16GB RAM option, and all the research I found showed that no tester has been able to even saturate the full 8GB of RAM yet, so I’m sticking with the $200 cheaper option of 8GB RAM. For the past month, with heavy development, compiling, photo/audio editing, and browsing (with Brave or FF), I haven’t hit more than 6GB of utilization at one time. The memory management on this is really phenomenal.\n\nIf you’re thinking about it, and the desktop form factor can work for you, you should definitely pull the trigger. This is a super deal, and I’m excited to see what advancements come from more Apple silicon in the future.", [1], [3, 7, 9, 160, 163, 297, 299, 174, 51, 70, 72, 206, 335, 210, 345, 353, 360, 368, 117, 249, 251, 127], ["review", 14]], [4.0, 0.3612, "Bleeding Edge with Pros and Cons", "You'll see every tech blogger, small-time journalist and \"influencer\" with a video channel raving about these new M1 Macs. Me? I'm not seeking any fame or clicks or readership. Here are my pros and cons:\n\nPros\nDefinitely fast. It's the future of Macs right here right now. Relative cheap compared to my Mac Mini 2018 bought for $1499 (Core i7, 3.2GHz, 8GB RAM, 512GB SSD). And yes, it's not as noisy nor hot.\n\nCons\nOnly two Thunderbolt/USB-C ports instead of previous four. This alone had me hesitating and preparing months in advance to figure how to connect all my peripherals before I committed. And I still wish for a third USB-A port. Also, the M1 hardware runs only the latest software! This means only MacOS Big Sur and only your latest apps and utilities. What will work and what will not work? You don't really know until you try it. I found out the hard way that I had to abandon Vectorworks 2019 and prior, SimpleClock (desktop analog display) does not install, no DJI Assistant (still testing alternatives), and some songs will not convert while syncing, some apps will not open in 2nd display regardless of dock options. Just weird little things that should get ironed out as time goes on.\n\nOverall, still good strategy for me because I was able to sell my old Mac Mini 2018 for top dollar at this point in time. In fact, the net expense for me was nearly zero! Just like spring cleaning reconfiguring my apps.", [], [130, 267, 268, 271, 31, 292, 294, 45, 185, 191, 64, 65, 199, 207, 85, 91, 106, 109, 239, 125, 255], ["review", 18]], [4.0, 0.296, "Setup issues frustrating", "Replaced 8 yr old iMac with new mini Mac. Lots of issues at first\nOnly 2 USB ports\niPad can’t sync\nBluetooth speaker could not pair.\nBluetooth mouse would not pair\nPrinter was not recognized\nResolved all of these issues except still can’t sync my new iPad otherwise mini is running smoothly\ncontacted apple support but they could not fix however later that day sync started to work ?? go figure\n05/09 when I connect an external hard drive mouse freezes? Photos mysteriously appeared on my iPad without syncing. iPhoto had duplicate and some triplicate or more duplicates. Problem may be with iCloud so I turned it off and restored ipad and photos to how I wanted them. Music file disappeared again from the computer but I was able to restore it from my backup.\n05/10 everything working ok except the mouse issue.", [2], [131, 39, 8, 135, 108, 141, 112, 84, 119, 150, 87, 60, 126], ["review", 8]], [1.0, -0.4767, "Half Baked", "My 8GB Mini was plagued with problems right out of the box. Random pink screen when booting and flashing green/pink horizontal artifacts when using the desktop environment. Kernal crashes at the App Store when applying updates. Then after wiping the OS I get errors when creating a user account regardless if I use iCloud or not. This is a terrible user experience coming from Apple. It feels like I’m using a Linux box with outdated drivers. Never have I been so frustrated with a new Apple product. Note: this isn’t happening to everyone, but there are a bunch of similar experiences popping up on message boards. Some say it's a Big Sur/hardware driver issue, but whatever it is, it's rushed. Apple blew it with the cheapest entry to their M1. What a shame.", [], [2, 68, 6, 72, 139, 46, 48, 152, 56, 89, 26, 93, 30, 63], ["review", 10]]], "Value for money": [2.0, 0.26127500000000003, [4.0, 0.2382, "Good quality, and consistency across products", "The fact that is no user upgradable, is a big turn off. i bought my first apple a macbook pro in 2012 it was extremely slow, until after i installed more memory and swap the hard drive for ssd. Now apple decided to make this machines not user upgradable, if you need more memory or a bigger hard drive you have to pay more than double what you will spend making the upgrade your self, and you have to decide it at the time of purchase. Greed I suppose. Any way the M1 chip on this machine is a big improvement in speed, and so far I am very please with it. And something else, for the initial set up is better if you have a wired keyboard available, it can be done with a wireless keyboard but you will have to Google it to find the instructions because Apple doesn't include a guide on how to do it.", [0], [161, 67, 4, 132, 38, 108, 118, 93, 62], ["review", 5]], [1.0, -0.4549, "what a disappointment", "Arrived and problems started after several hours trying to make it work. The Bluetooth will not connect properly, , had to use wired keyboard and mouse to make it work, then forced to use a hard wire internet cable because the Wi-Fi not work and after 3 hours on the telephone with apple support, they could not fix the HDMI socket.\nAnd to top it all I'm having to pay to return a defective product .\nNever in my life had so many problems with an Apple product.", [2], [2, 34, 68, 38, 75, 79, 56, 89, 92], ["review", 3]], [1.0, 0.6369, "Total Disappointment", "I was excited to try the M1 Mac, but then the problems started. There is a major issue with the M1 chips and the graphics connection. The computer constantly drops the second monitor connection. After the computer goes to sleep, you have to unplug and re-plug in the monitor cable, to get the display working again. This happens several times a day. Apple has acknowledged this problem in England, but has not done so in the US.\n\nBig Sur 11.2, which was supposed to fix the problem, actually made it worse and can completely block the use of a second monitor by not recognizing it’s connected. Big Sur 11.3 was also supposed to fix the issue too, but again, Apple did not resolve the problem. Since two updates have been unable to resolve the issue with the M1 chip and external displays, and this issue occurs with all M1 computers, it makes one wonder if the issue is with the design of their new M1 chip, and not something that can be easily fixed.\n\nAfter 3 weeks of using the M1 Mac Mini it started causing static/snow on one of my monitors while the Mini would make a horrible squeal. This only happens on the monitor connected via the HDMI socket, and lasts for 5-10 seconds before the desktop appeared. After that started happening, it was clear this M1 Mini would never last, and I decided to return the item.\n\nApple used to be the best computer company on the planet. Now, they're just like everyone else, but overcharging for their poorly designed products. I've used Apple products for decades, without issue. I was happy to pay more for high quality products that were, generally, issue-free. I've now had a problem with the last 4 Apple products I've purchased. The days of Apple being the best in the market are long gone.", [1], [2, 7, 136, 139, 12, 141, 268, 273, 274, 150, 285, 30, 32, 40, 300, 310, 312, 193, 70, 71, 74, 203, 204, 330, 79, 335, 216, 344, 347, 220, 97, 102, 106, 242, 252, 255], ["review", 17]], [2.0, 0.6249, "Why are people OK with paying $200 for 256GB of hard drive space?", "This may be a good machine but it comes with such little hard drive space rendering it practically useless. Then they want to charge you $200 to add another 256 GB. This is so overpriced it is lunacy to ever pay this. I do not understand why people are OK with this. I bet people even try to defend it. Apple has got a great racket.", [11, 3, 5], [66, 67, 4, 70, 43, 12, 18, 53, 22], ["review", 5]]], "Tech Support": [3.3333333333333335, 0.4681666666666667, [4.0, 0.9116, "Amazing and snappy, but with caveats", "First, the price point for this at $30 under retail was great, but it would have been nice to purchase the 16GB option.\n\nAs a first time macOS user, the setup was quite bumpy. Rosetta seems to work great with certain \"unsupported\" applications, in some cases not expecting it to work at all, and would without any hiccups or noticeable slowness. This was the case with Runelite and enabling the GPU plugin made the experience buttery-smooth on an LG 3440x1440 IPS display.\n\nHowever, Firefox (without installing the beta M1 supported version) would consistently freeze and crash and it seemed to be ruled out by plugins, but even without that, certain websites wouldn't work and loading pages after each click took way too long. I experienced another bug with Discord and couldn't see its login setup screen due to what seemed like a file association or visual glitch, and I found out there's no good uninstaller option natively on macOS other than just binning applications to the trash and clearing it from there. So, I had to uninstaller a third-party app to remove all file associations when the application was installed to finally get a clean install and thankfully the Discord install worked well after that.\n\nThe other downsides for me are general unsupported SOC from various companies/applications, in case I wanted to setup a VM. No eGPU support, and no RAM upgradeability, but that's a given considering the new SOC, just would have been nice to upgrade on our own (and hopefully have made design tweaks to make those upgrades easier for users). Would also have been nice to see a smaller footprint for the enclosure, since it's quite a small SOC based on images I've seen online.\n\nYou may find yourself feeling like a beta tester, it can get pretty frustrating. So consider yourself warned. Hopefully companies release M1 compatible applications soon. Overall, I'm fairly satisfied and hopeful for more application support in the future. Would highly recommend it for more casual users because it seems like it would be an amazing value under that use case.", [0], [257, 382, 387, 388, 13, 147, 20, 275, 283, 160, 292, 44, 301, 46, 174, 48, 175, 316, 190, 330, 331, 339, 340, 345, 218, 347, 221, 223, 226, 103, 360, 362, 108, 237, 110, 366, 373, 246, 254, 377, 252, 126], ["review", 14]], [5.0, 0.5956, "Amazing tiny little box!", "So the last time I bought a Mac was January 2011. That laptop lasted nearly ten years, but it was time for an upgrade. I saw the hype/ads around the new M1 chip and decided to give it a try. But me being me... I tried it in the cheapest way possible. For context, my Romany computer for the last few years has been a $35 raspberry pi 4.\n\nHaving said that, I hooked this box up, restored my laptop’s backup, and let it rip. Turns out, some of my favorite software packages are no longer supported by Mac OS. But some are, and though they are still compiled for intel CPUs, they still ran fine. I don’t really miss the unsupported apps.\n\nLong story short; I do have a fairly extensive media library. This low-cost box can convert a two hour movie in three hours; my other aforementioned box took over a week for the same task. The UI in Big Sur is awesome, my kids love it, and all said, it’s super fast. Like, you’ve never seen it before fast. Totally worth giving it a try.", [0], [191, 195, 69, 134, 7, 106, 141, 110, 143, 112, 205, 114, 208, 88, 220, 221, 63], ["review", 14]], [1.0, -0.1027, "Always a bad idea to buy a Mac", "Here is what Apple does, they stop supporting products that are built so well they last decades. They sabotage the software and make it impossible or very difficult to maintain these products. I could give dozens of examples.\n\nIf you buy this Mac you will have to upgrade to a new one in five years. for some reason they will no longer support and you will find software you paid for no longer works because of changes they made to make it not work any more.\n\nApple is in bed with the advertisers and your screen is under their control. Now that Apple has moved away from Intel, you won't be able to install Linux on your machine to bypass all that.\n\nWant an Apple? Buy one with an Intel CPU so when Apple suddenly decided to cripple your machine and screw you over, you can still use it to run Windows or Linux.", [2, 7], [65, 3, 67, 132, 134, 7, 8, 76, 109, 14, 46, 110, 144, 20, 152, 92, 29], ["review", 8]]], "Sheerness": [4.5, 0.0, [5.0, 0.0, "A new age in computing", "I got the stock package which is a 250GB SSD and 8GB RAM. There are lots of online reviews that say \"you don't need 16 GB RAM\" and that is true. Photoshop and Lightroom are my two most intensively used apps and they both blaze on this compared to my Intel Macbook Pro with 16GB of RAM. For storage I have a 4TB SSD and the transfer rates over the Thunderbolt 3 connection are blazing fast; 8 GB file moved in 15 seconds. Apparently the M1 architecture moves stuff between RAM and SSD so fast that you just don't need more RAM. Naturally, there are still a few bugs so that Lightroom, especially, crashes fairly often. I expect that once Adobe gets their apps revised for the M1 chip that problem will end and it'll be smooth sailing for some years. (Aside: Amazon wants me to rate this machine for \"thickness\" and \"sheerness.\" Apparently they think Apple makes pantyhose.)", [], [160, 161, 34, 173, 144, 179, 126], ["review", 8]], [4.0, 0.0, "Two out of three ain’t bad.", "Not as easy to use as iPhone and iPad but I like it. I don’t know what “sheerness” means as it pertains to a Mac mini so I had to give it one star.", [7], [29, 2, 11, 21], ["review", 0]]]}