[{"polarity": "pos", "name": "Amazon Addict", "stars": 5.0, "title": "Superior to most! Love it!", "content": "I was surprised to see no reviews for the Jet 75 and there is no youtube videos either. Before I made my purchase I relied on the youtube reviews of the Jet 90 which is essentially the same vacuum but with the mop attachment (as far as I gathered.)\n\nJust to give you a little background: We have tiles, laminate and area rugs. I come from using mid range corded vacuums and I have never made such an expensive purchase before for a cleaning tool. We have two dogs, one of which sheds - a mini pincher, the other one does not- wheaten terrier. You might say that given the small size of the mini pincher, I shouldn't complain about the hair on the floor and furniture but believe me, I vacuum 2 times a day and there is still hair to be cleaned.\n\nI initially purchased a cheaper stick vacuum which did not satisfy my cleaning needs but did show me that you can't beat the convenience of cordless if you vacuum multiple times a day.\n\nSo here I am, giving you my initial thoughts on this \"monster\" of a vacuum stick.\n\nThe Jet 75 is very powerful! You wouldn't believe it! I am beyond impressed with the suction power and ease of use. Here are my pros and cons:\n\nPros:\n- cordless (obviously)\n- power - the low setting is fine (about 110-120 AW), mid level is awesome (around 140-150 AW), and the high is insane (around 200 AW.) It actually makes it a bit hard to vacuum a carpet on high cause it sucks so hard and needs a stronger push -some may consider this a con where I don't mind it. No such issues on tile or hardwood floors.\n- attachments - there are plenty with my favorites- fabric/furniture/bedding brush and the elbow flex attachment.\n- great range of motion all around.\n\nCons:\n- it's a bit heavy in the hand- most of the weight is in the battery but that's not something you can part with to use it.\n- no LED floor light- it really helps to have it and I don't know why Samsung chose not to integrate it to the unit. I just purchased a battery operated closet stick led which I plan to mount on the front. Just ordered it today so not sure how well my plan would work yet. https://www.amazon.com/dp/B089JYP45L/ref=cm_sw_r_cp_apa_i_HywnFbY14M8Z9\n- mine came with no documentation- very odd as it didn't appear to be a used item. All is available online but I guess I'm used to Samsung's manual books.\n\nOverall, this is an amazing stick vacuum! If you are in the market for one, I would highly suggest you add this to your comparing list.\nPersonally, I was torn between the Jet 75 and the LG A9. The mate red LG which is in the same price point as the Jet 75, comes with an additional battery but suction strength is rated at 140 AW. Also, the LG comes with a floor stand should you not want to attach it to a wall or inside a cabinet. I went for the power.\n\nBut why not a Dyson, you ask? To me Dyson's are overpriced for the mediocre job they are able to achieve. One of my closest friends has a Dyson stick. The vacuum is a joke. I can't even compare it to the Jet 75 because you shouldn't compare apples to lemons . The only suggestion I would give is to look up the suction power and compare. At this time, a 200 AW Dyson costs $1000. It's insane what good marketing can do for a business lol\n\nI didn't mean to make this review so long but wanted to share my experience. If you have any questions, please free to ask and if I can, I'll give you an answer.\nOverall, the Jet 75 is awesome and if you are willing to spend the money, I very highly recommend it.", "helpful": 269}, {"polarity": "pos", "name": "CP", "stars": 4.0, "title": "Comparing to a Dyson V10", "content": "Edit: I didn't get this free, paid for it.\n\nBox arrived opened as it was sealed with one piece of tape. The product box looks like it’s been re-taped as well. Returned and ordered from Samsung.\n\nThis vacuum has a higher peak suction than the V10 but the battery only lasts 6 minutes. I haven't run scientific testing but the Jet on medium seems to be about as powerful as the Dyson on max. The Jet on max produces 200 air Watts of power (whatever that means) and on shaggy carpet, the Jet can be difficult to push unlike the Dyson.\n\nThe sound level on the Jet is MUCH quieter than the Dyson V10 on any level.\n\nThe Jet is heavier than the Dyson, it's noticeable. Samsung says the Jet is 6 lbs but it feels heavier.\n\nThe Jet battery is removable/replaceable unlike the Dyson. It comes with a wall dock and charger but there's no way to plug the charger directly into the vacuum like the Dyson.\n\nThe dustbin on the Jet doesn't have a bottom opening hatch. You have to remove the dustbin, take out the filter/center portion and empty the dustbin. It's kind of a hassle so I got the Clean Station which automagically empties the bin (a special bin that's included with the clean station).\n\nOverall as a vacuum, the Samsung Jet is better than the Dyson. It's heavier than the V10 but if purchased with the Clean Station, eliminates a big issue I had with the Dyson.", "helpful": 34}, {"polarity": "pos", "name": "Melrel05", "stars": 5.0, "title": "Love it!", "content": " This is my first ever stick vacuum so this review isn’t going to be a comparison between other stick vacuums but rather about the switch from a traditional vacuum.\n\nI’m in love with this Samsung stick vacuum! The suction on it is fantastic. It has 3 levels of suction and even the lowest setting has some power to it. The highest setting I can’t even push forward on carpet or rugs. To much suction for that! It’s also fairly quiet for a vacuum. Even the highest setting isn’t as loud as my regular vacuum. It’s pretty light weight and the maneuverability is amazing. Since the head is smaller and the body is a stick I can easily get under beds and other objects that I couldn’t do with a regular vacuum. The convenience of it is also fantastic! You just lift it up to take it off the charger, press a button and choose a power setting and go. And when your done you just put it right back on the dock charger. It comes with all the attachments in my photo. I have a home that has mostly hardwood floors except for one large room in the basement that has carpet. We also have multiple rugs around the house. This can definitely tackle all of the above m, however I will say Th at if you have all or mostly carpet this probably isn’t for you. Which brings me to the cons.\n\nBeing this was the first stick vacuum I’ve ever had I’ve learned over the last week what the differences are in a regular vacuum and a stick vacuum. As I said before if you have all or mostly carpet in your home this isn’t going to be for you. While it does work well on all my rugs and it can do a carpet pretty well my old school vacuum works better for carpet. Don’t get me wrong this does clean them, but not as deep and as well. It’s head is also smaller so it takes A bit longer. Also the battery doesn’t last very long. It says 1 hour on lowest setting and without any power attachments. Which means the only things that last an hour are the crevice tools... I got about 20-25 min on full power, and about 35 min on med power. Charging takes almost 4 hours to fully charge. I’m definitely going to need to purchase an extra battery because when I’m cleaning I don’t want to have to stop for hours to wait for it to charge. Also the attachments don’t all fir with the docking and you will have to store some separately Mx I wish they were all in one spot. Also emptying it could be a bit better/easier. I wish there was just a button to press that you could hold it over the trash and it would Cope and close. Instead you have to press a button, unscrew the top, take the bottom and top it over to dump it out then put it back together. It’s not super hard but it’s annoying and could be better.\n\nOverall I’m not docking any points because of the above mentioned cons. Only because it is my understanding this is all typical for a stick vacuum. But even with these cons I love this thing and I think everyone needs one of these!", "helpful": 57}, {"polarity": "pos", "name": "Angelo", "stars": 5.0, "title": "Excellent vaccum better than competition", "content": "I waited awhile before writing this review because I wanted to get a good feel for how this samsung jet vacuum really worked. Let me just say that it is great. It is so much better than my old purple stick vacuum that you always had to use max suction on and would die in 10 minutes. The battery life is excellent and it has amazing suction. I hardly ever have to use the highest setting for cleaning around the house and when you do it pulls so hard it is that it makes trying to vacuum my area rug difficult but in a good way. The pop off debris canister is awesome and everything comes out of it with a shake not like the other stick vacuum I had where I had to get my fingers in there and clean everything off of it. I would highly recommend its great quality comes with all the attachments that you need and is better than the other guys. Good investment!", "helpful": 21}, {"polarity": "pos", "name": "LionelVII", "stars": 5.0, "title": "What an amazing stick vacuum", "content": "This thing is amazing! Battery lasts long enough to clean 3 floors of my house. I cleaned the stairs on high since it's the only carpeted area of my home. This thing picked up all the dog hair. It's lightweight but doesn't feel cheap. Easy to bend down and clean under bed and baby's crib. I highly recommend this vacuum! Normally when I vacuum I get itchy and runny nose from my dogs hair but with the HEPA filter this has I noticed I didn't have that issue. Love this vacuum.", "helpful": 17}, {"polarity": "pos", "name": "Andrew", "stars": 5.0, "title": "Best cordless vacuum you can get.", "content": "This vacuum is nothing short of amazing! I have owned a couple vacuums frim the more expensive competitor and there's a night and day difference. I have a dog and cat, the Samsung doesn't miss a beat with pet hair, I have yet to have a clog! The battery lasts a lot longer than stated. I charged it out of the box and I can easily vacuum my townhouse 3 or 4 times on a single charge. The attachments are great, it is very quiet for having so much suction. I took it over to my ex wife's house so she could see how great it was. She ended up ordering one that night. I wouldn't hesitate to buy another or suggest everyone buy one.", "helpful": 15}, {"polarity": "pos", "name": "Lori Spiegler", "stars": 4.0, "title": "Love it but word to the wise on the dust bin..", "content": "I love it, the suction is amazing but I sprung for the dust bin and shouldn't have. First it takes up room and was expensive for a glorified trash bin. Second I just found out there is no where, at least night now to find the bags the bin requires. (2020)", "helpful": 10}, {"polarity": "pos", "name": "OKC_Husker", "stars": 5.0, "title": "First Stick Vac Owner and I’m Sold", "content": "I like that this make sweeping fun and easy. I feel it cuts down manually sweeping times by 50%. Do not throw away your broom!!! This thing doesn’t get the crevices that good. But does have a nice crevice tool if you do throw away your broom. THIS does NOT work for expensive thick plush carpet. It just get stuck and red message pops up. Same with thick rugs. This is more so for any hard floors. I still used the old fashion vacuum 4 the bedrooms\n\nTHIS THING WILL CLEAN LIKE NO OTHER. you can really feel the suction and the squeaky clean floor underneath. I used it for my car also and wow so easy light weight and convenient. The battery does last 60+ min on normal or less power. Turn it to MAX and you may be lucky to get 25-30 mins of cleaning time. The battery charges up fast enough in between cleanings for me. Maybe if you have all hard floors 2250 ft + you may want to purchase another battery", "helpful": 4}, {"polarity": "pos", "name": "kitalix", "stars": 4.0, "title": "Decent alternative to replace my old Dyson", "content": "The main issue I have is with the mini motorized tool. The actual brush head that makes contact with the surface is much smaller than the width of the tool itself. There's about 2.5\" of surface area that is not in contact with what your are cleaning, absolute wasted space. So frustrating when you try to clean in corners. And it has these strips of material that behaves like a lint brush and collects fur and lint so you have to scrape to clean it afterwards. Pointless. I've attached a photo of the brush head after I vacuumed to carpeted stairs and then after I scraped the accumulated debris off the strips. The mini motorized tool on my old Dyson is engineered much better. Aside from that it's great: easy to use, easy to maneuver, easy to clean and lightweight. Also love the soft roller head and that I don't have to hold down the trigger to keep the power running. Grabbed an extra battery pack and can clean entire apartment with no worries.", "helpful": 6}, {"polarity": "pos", "name": "Queen of Mesopotamia", "stars": 5.0, "title": "Samsung vacuum cleaner", "content": "I purchased the Jet 90 model due to the charging stand which was included with my purchase. The two models are identical except for the telescopic pipe which is needed in order to accommodate the charging stand.\nPros: 👍\n- great suction power;\n- soft brush for hardwood floors leaves floors shiny;\n- all brushes are easy to clean;\n- the dust bin and filter are easy to clean (w/option of buying Clean Station);\n- removable battery.\nCons: 👎\n- no lights;\n- hard to clean under the furniture due to the brushes being bulky;\n\nMy only complaints are missing lights and the lack of a flat “under-the-furniture” brush. I solved the lights problem with the item I found on Amazon-see link below: https://www.amazon.com/dp/B0721NYMJN/ref=cm_sw_em_r_mt_dp_ZJ1T2HPCETS0WVJRPJZT?_encoding=UTF8&psc=1\nI would gladly buy an additional accessory - flat brush - in order to be able to clean under the furniture.", "helpful": 4}, {"polarity": "pos", "name": "Christina Naomi", "stars": 5.0, "title": "Samsung for the win! Sleek and well built!", "content": "I recently pulled all the carpet out and put vinyl flooring in the whole house. I have a Roomba that worked well with the carpet but with the vinyl I always had dirt or dust on my feet. It was driving me crazy I lived with a broom at my hip and still felt like I was just moving dust around!\n\nAfter reading alot of reviews and researching Samsung vs Dyson I realized with Samsung I would get an hour of cleaning vs 30min with a Dyson. Also the Samsung looked sleeker.\n\nNow there are no cons to this vaccum. I put it to a rug and got so much gunk! The Roomba ain't got nothing on this cordless beast. I feel like a cleaning addict and that's okay! Air and floors felt cleaner after one use! My 3 cats probably think I'm crazy because I use the adapter and clean their cat house 2x a day! I highly recommend this vaccum more bang for ur buck. I just couldn't bring myself to pay $500-600 for a Dyson. This one is perfectly priced.", "helpful": 2}, {"polarity": "pos", "name": "Lynn", "stars": 5.0, "title": "Gem of a vacuum", "content": "I have a built in vacuum system which is great but hauling out the hose is not convenient for quick vacuum jobs. So the dog hair and kitchen crumbs pile up- but not anymore. Our house is primarily hardwood floors and tiles. I have been reluctant to purchase a cordless stick vacuum because I have had one for years that is pretty worthless. I thought any cordless vacuum would not have the power needed to really do the job, but I was wrong. This Samsung cordless is a whole new world. I am wondering why I waited so long to purchase this gem. It really sucks, in the best possible way. I can use it on medium level and it does a great job of picking everything up. I have found that I rarely have to use the high power level. As others have mentioned, it is a bit heavy due to the battery, but not so heavy that it is really a problem and I love the power the battery provides. It maneuvers very easily, around and under furniture, works great on area rugs, but not sure how easy it would be to push on a high pile carpet. I wish it stood up by itself. You have to lean it against something or lay it down or hook back up on the charging station. You do have to have a place to conveniently install and plug in the battery charging station. I do not think the Clean Station is necessary. It has not been that messy to empty the debris container and even is you use the Clean Station you still have to disconnect the debris container. My floors are now going to be consistently dog hair and crumb free.", "helpful": 1}, {"polarity": "pos", "name": "Love", "stars": 5.0, "title": "Awesome", "content": "This is like an iPhone among vacuum cleaners. It's very well crafted and pleasant to use. I didn't know I would be so excited at a Vacuum cleaner. With this guy, I ended up cleaning my house two to three times a day.", "helpful": 8}, {"polarity": "pos", "name": "boater4life", "stars": 4.0, "title": "Great vacuum but battery not holding charge", "content": "Great vacuum BUT had vacuum a few weeks, easy to put together, install battery pack and suction is great. Lightweight, easy to maneuver and clean, however after about the 5th week, attempted to vacuum the house on a full battery charge and after 4 small rooms the battery died/ roughly 15 min. I love the vacuum but that is unacceptable. Called customer service and they sent me a new one/ they are unable to just replace the battery pack. This new one will be going back if the same situation arises. Have to wait and see. Lithium batteries should NOT be dying after that amount of time.", "helpful": 3}, {"polarity": "pos", "name": "Richard S", "stars": 5.0, "title": "wow! Great suction and light weight, perfect for stairs", "content": "I've had several upright vacuums over the past 20 years, each carefully researched for the best reviews, strongest suction and the appropriate accessories. Each is still going strong and we even added a few Roombas into the mix to keep up with all the mess, but with 2 large, long hair dogs, using the uprights on the stairs was getting to be too much, making matters worse, my wife couldn't use the uprights on the stairs. Until iRobot invents a stair climbing robotic vacuum, I needed something that would get into the corners of the carpeted stairs as well as the foot surface and was light enough to carry up and down 2 full flights of stairs. I did a lot of research and narrowed the choices down to the Samsung Jet series and the various new Dyson V series. There is a channel on Youtube that does reviews and the review from Dec 2020 was very positive about the Samsung Jet 90 and it compared very favorably to the much more expensive Dysons. Since this purchase is intended to deal with the stairs and occasional spot cleaning to catch the hair tumbleweeds during shedding season, this didn't have to have the longest battery life or the widest vacuum head. The 75 is exactly the same vacuum as the Jet 90, only it doesn't include the upright charging stand and an extendible tube. This is an additional vacuum to the Roombas and the uprights, so I picked this up when it went on sale and haven't regretted it at all.\n\nI've used it a few times and was amazed at how much hair the powered head was able to pull out of the stair carpet. I thought the stairs were reasonably clean, but I emptied the bin 3 times before finishing! I originally thought that I'd need the small powered head to do the stairs, but the large head and the extension were light enough to be able to easily and quickly do all the stairs without breaking a sweat (can't say that about the upright corded vacs!). Also, the head articulation is very good so it was easy to clean both right to left as well as left to right, so I felt the design made it easier to do a more complete job.\n\nI've played around with the soft powered head for hard surfaces, and it works fine, but since the Roomba does a good job maintaining the floors, I don't expect to use it too much.\n\nOverall, I think this is a great vacuum and I'm happy with the purchase!", "helpful": 1}, {"polarity": "pos", "name": "Rena Killian", "stars": 4.0, "title": "Light weight and works OK", "content": "The vacuum was easy to put together and maneuvers great; goes under cabinets fairly well, too. I am a little disappointed, though, about the way it vacuums. For example, if there are small cracker pieces on the floor, it's difficult to pick them up. I'm going to try a different head. Putting the cannister back on after emptying is a bit of a challenge. You need to carefully line up the connections and make sure it snaps into place. Also, the vacuum will not stand up by itself. You can carefully balance it on a cabinet of something, but it won't stand alone. The battery indicator has 3 lights and, after using to clean 1 room, it's down to 2. I've never run out of charge so I don't know if this is normal or if it will run down.\nThere is an indicator light that appears when vacuuming a carpet. I think it means that the roller has been stopped by the carpet pile. (It shows in the manual but it never explains what it is. I called Samsung but the person didn't know what it meant, either.) It till works, but the roller brush stops rolling. You need to turn it off to re-engage the brush,", "helpful": 1}, {"polarity": "pos", "name": "Mark the Amazonian", "stars": 5.0, "title": "Liked it so much, I bought another", "content": "I was a diehard Dyson user, but got tired of replacing batteries. The last one lasted 3 months before no longer holding a charge (and we vacuum about twice a week). I did some googling and ended up with the Samsung Jet 75. I had originally planned to use it just to replace a dyson handheld. I ended up using it in place of our Dyson corded vac. It has plenty of suction for our area rugs (we have a shedding dog). It's light. The powered heads are great on carpet, tile, and hardwood. My only complaint is about the occasional time the battery won't be charged enough to do an extended cleaning because I only charge the battery when it is at a single bar or lower. This could be addressed by a second battery or just charging it after every use. Anyway, great vacuum. It came up on sale again on Amazon. The battery is $150 alone, so I bought another vacuum for use around the house.", "helpful": 1}, {"polarity": "pos", "name": "Lance A", "stars": 4.0, "title": "Works well only on hardwood floors", "content": "Vacuum is nice quality, the battery only last about 15 minutes tops on medium speed, so far so good but it’s only been a couple weeks with the thing, I have all wood floors and some rugs, when going over the rugs the vacuum struggles pretty hard but does well on hard surfaces , the dog doesn’t like it but I don’t like the dog!", "helpful": 3}, {"polarity": "pos", "name": "MaryJane", "stars": 5.0, "title": "Better than dyson animal", "content": "This is a life saver! I have animals and am always needing something for my floors and walls. This picks up everything it needs to, doesn’t get clogged easily bc it won’t pick up the items it isn’t supposed to. It works longer than most cordless and has 3 levels of power which really helps out on multiple types of floors and curtains. This purchase was out of dispite w my dyson animal that I ordered only 6months ago, it is fine for small jobs but this Samsung is amazing at every job. Plus it’s easier to empty and cleaner at the empty level. Dyson is no longer the leader of the pack! Thank you Samsung!", "helpful": 1}, {"polarity": "pos", "name": "blssdrtheprnsprt", "stars": 4.0, "title": "Battery life claims is deceptive. If you run max power your battery will last 10 minutes.", "content": "Battery life is horrible. For the price they should have provided a spare battery. To buy an additional battery is $100. Yikes! After already spending more than a Dyson that makes me sick. Overall I really like it, the battery life is a huge complaint. I feel like the battery life claim is really deceptive by Samsung. There should be a huge asterisk by that claim, saying only of you use low suction and NO motorized attachments.", "helpful": 3}, {"polarity": "pos", "name": "MIReader", "stars": 5.0, "title": "Head and shoulders over my Dyson!", "content": "Didn't think I would say this, but this Samsung is far superior to my Dyson stick. I am absolutely pleased with the suction power. Having different levels of suction is a nice touch and I do find myself switching between them depending on the thickness of the carpet I am on.\n\nThe ease of maneuvering is a pleasant surprise also. What I like about the Dyson is the ease in getting under chairs and couches along with around corners. This Samsung is just as good.\n\nAt first I didn't think I would like having to switch the heads when going between carpet and hard floors but I think that is what makes this so superior to the Dyson. Having brushes specifically for the different flooring helps the vacuum in overall performance. It is no hardship at all at this point in view of how much more dirt, dust and fur gets picked up daily."}, {"polarity": "pos", "name": "kallisti5", "stars": 5.0, "title": "Overall a great vacuum. Dyson quality at a reasonable price.", "content": "Overall, the Samsung Jet 75 is an amazing vacuum. Massive amount of power in a really small form factor. The powered heads do a great job *deep* cleaning. The vac is compact and comfortable.\n\nThere are drawbacks in the Jet 75 though.\n* The base doesn't allow charging a second battery. You'll have to swap back and forth\n* The Jet 90 solves this with a better floor charger that allows charging a spare battery in the base station... but it costs *MUCH* more.\n* There's only room to store two accessories on the wall station. The rest of the tool heads will be in the bottom of your closet.\n\nPretty much, the wall mount with limited battery charging abilities is the only downside. For the price though the Jet 75 is an awesome deal."}, {"polarity": "pos", "name": "D. Miranda", "stars": 4.0, "title": "It can get under most furniture , but not all.", "content": "This vacuum surprised me. It is much easier to use than I thought it would be. It is easy to maneuver around and under things. A few of my furniture pieces are too low, so I use a swifter there. Mainly I got it for daily dog hair duty and it work very well for that. It is easy to empty, and the battery has never run out of charge when I do the main rooms, kitchen , dining room and living room. I mostly use med power with occasional high. I am satisfied that it does what I wanted.", "helpful": 1}, {"polarity": "pos", "name": "Amazon Customer", "stars": 5.0, "title": "Kicks dyson’s ass", "content": "So I went through a breakup and he took the Dyson stick vacuum. I knew I wanted to replace it with something similar but honestly the battery life and suction power on the dyson left a lot to be desired. I would barely make it through 2 rooms. So I rolled the dice on this Samsung and let me assert it has not disappointed! The suction power is insane strong on the high setting, it’s really good on medium, and meh on low. The battery lasts me through 3/4 of my 3000sqft house so I have yet to buy a back up battery but I’m glad that I have the option to unlike the dyson. The wall mount is sleek and attractive, the attachment options are great, and emptying the bin is a breeze. Can’t recommend this vacuum enough.", "helpful": 2}, {"polarity": "pos", "name": "Gigipaints4life", "stars": 5.0, "title": "Why did I wait for this!???", "content": "I can’t believe I waited this long to buy a vacuum like this one. I was on the fence between a stick and a robot vacuum. Once I decided to try a stick first, I narrowed it down to 3 choices: Samsung, dyson, and my favourite vacuum - Miele. This one had the best rating for the price. It delivered. The only thing I can say, it doesn’t suction on the ends great, so you need to used attachments for corners (which is ok) also, it’s worth the funds for an extra battery. I can do my entire house on med setting, but we have cats and sometimes I need to use the high setting which drains the battery quick. I researched all the stick vacuums thoroughly, and I can definitely say this one gets the biggest bang for the buck. Oh, and it’s super quiet!", "helpful": 1}, {"polarity": "pos", "name": "Pvs", "stars": 4.0, "title": "Excellent Vaccume", "content": "we have 1 Dyson V6 Absolute at our home and 2 Samung ROBOVAC's and 1 Roomba.\nour dyson stopped working couple of months and i always want to move away from dyson as the samsung robovac's i have will do excellent job. so i want to try samsung stick vac\nI ordered this one 349$, its worth the money, less noisy than dyson, more suction power.\nI gave one less star because, dyson customer service is excellent, not sure how samsung will help if there is any issue with battery. but my other robovac's are going strong after 3 years.", "helpful": 1}, {"polarity": "pos", "name": "Angelo DiLullo", "stars": 4.0, "title": "The product is great for hardwood floors, not so good for carpet.", "content": "The vacuum works very well on hard surfaces, but is difficult to use on carpet, even very low pile carpet. However, after 2 hours on a chat with 3 different people at Samsung customer support, they refused to honor their warranty. My issue was a very small one and could have been resolved with a $2.00 part. AMAZON, on the other hand, cheerfully replaced the entire unit. Moral of the story: Buy more from Amazon, but not Samsung products.", "helpful": 3}, {"polarity": "pos", "name": "West LA Guy", "stars": 5.0, "title": "So far, so good.", "content": "I’ve only had this for a couple of weeks but so far I’m completely satisfied. The portability is excellent, the suction is excellent & overall my satisfaction is high. Not being attached to a cord rocks! The only gripe I have is that there is one attachment that appeared to be a brush head but in fact the brushes don’t extend beyond the edge of the hard plastic inside and so it really isn’t a brush head. Why? 🤔 As long as it doesn’t break, I’ll be satisfied.", "helpful": 1}, {"polarity": "pos", "name": "JB", "stars": 4.0, "title": "Decent for “maintenance” cleaning", "content": "The vacuum mostly lives up to it’s description. I had short battery life when I first took it out of the box and impatiently tried it out, but with subsequent charges I get 15-20 min on medium (which works fine). For me the wide / hard floor brush and the upholstery brush were pretty lousy. The former mostly kicks stuff around and gets pet hair caught in the “wheels”, and the latter doesn’t have suction to the edges and seems kind of clunky. They’re pretty worthless and poorly designed. I wish it had a plain floor nozzle (without a motorized brush) for hard floors, and a better passive (no motor) nozzle for furniture. The powered carpet brush is good, and I like that it is about the right width to handle stair treads in the “long” dimension. It’s convenient, light, and it does pick up a lot of pet hair and dust. The dust canister is a bit fiddly to remove/attach but works fine. It’s definitely not as powerful or effective as my corded canister (Miele), but better than a Roomba and great to keep the hair and dust under control until I can “deep clean” with a real vacuum."}, {"polarity": "pos", "name": "JS", "stars": 5.0, "title": "Good so far after using it for 1 month", "content": "The products looks good so far. Light enough to carry. One full charge is enough to clean 3 rooms house (mostly hardwood, average size carpet and carpeted 1 floor high stair). Cleans dust pretty well. Cleaning stairs is a bit challenging because of the cat's hair. Small cleaning tool works well, but can require several passes to remove all hair from a step.\nCleaning the container is very easy. It is not large, but it is not a problem for me.\nTo keep battery safe we try using almost all power from the battery, charge it and disconnect charger from the electricity to do not constantly overcharge it. Let's see how long the battery will last."}, {"polarity": "pos", "name": "Dale", "stars": 4.0, "title": "Almost perfect...", "content": "We keep our windows and doors open nearly 24/7/365, that means sweeping is a neverending battle, and I hate sweeping! The 75 is great for that, it even cleans the throw rugs fairly well, on low or med that is... On high it just sucks up the rug and the roller stops moving. Not a big deal though... I really only have 2 rather glaring issues... On high you get 10min at most, while that's to be expected, for nearly $400 it should come with 2 batteries!!! Then there is the wall mount... Absolute trash! Why does it only hold 2 of the 4 attachments?? Where do the 2 extra brushes go?? I mean, I fixed the problem with a shelf but at this price point it shouldn't have been an issue."}, {"polarity": "pos", "name": "Bo Pham", "stars": 5.0, "title": "Good design at a decent price.", "content": "I had this vacuum for a week and found that the suction power was good and the design is excellent. I was torn between this and the base model Dyson V11. I like the design of this vacuum better and found that accessories and build of this vacuum was better with the exception of the regular torque drive head. The bristle roller on this Samsung is “soft” which leads to less than ideal agitation of the carpet. This is a bigger deal if you have carpet that have longer piles. This was my main reason on finalizing with the V11. Additionally the v11 has better battery life but lacks the ability of removable battery. Third party support for the Dyson is also better as it is more mainstream but Samsung provides you a solid offering of quality accessories you could purchase for this vacuum.", "helpful": 1}, {"polarity": "pos", "name": "Joany A", "stars": 5.0, "title": "Does a great job", "content": "My MIL had a coffee pot graveyard and I am working on a vacuum one. My husband loves the Kenmore cannister and I hate dragging the cannister & it kills my back. I have an Orek that I love on my 2 area rugs but not suitable for hw floors which are throughout my house. Tried a Levoit which was ok for the money but the dust bin constantly clogged from the cat hair. This is the best for both surfaces, picks up everything and the dust bin is easy to empty. The only thing I don't like is the handle - hits your knuckles if you don't hold it a certain way but I have small hands so easy for me to use without using the finger rest."}, {"polarity": "pos", "name": "Amazon Customer", "stars": 4.0, "title": "Light and easy to use", "content": "I love this for my tile floors. The carpet attachment works great as well. The dust free cleaner is by far the best ever. The only thing that I don’t like is that the battery doesn’t last long enough when on high suction, especially with the carpet attachment. I think I just need to get a couple extra batteries and I will be all set. I love this vacuum.", "helpful": 2}, {"polarity": "pos", "name": "Cora", "stars": 4.0, "title": "I'm glad we didn't let the bad reviews scare us", "content": "Initially we had picked the base version of Samsung vacuums + the cleaning station. After further research we realised the cleaning station bags are not possible to buy anymore and decided to put the money towards this model which includes the soft brush for hard floors. So far we are very pleased with this decision and grateful for all the people that saved us from buying an useless piece of electronic that would just take up room. It remains to be seen how it will hold up over time but it works well right now. It is nice that the battery is detachable. It would be great if a new one didn't cost as much as a brand new vac though."}, {"polarity": "pos", "name": "me2", "stars": 4.0, "title": "Vacuum is nice, the wall mount…", "content": "Very good suction, easy to turn, transitioning to throw rugs is easy. I have a Kirby vacuum but so strong you can not clean the small runners, it is also bigger and not maneuverable as the jet. I just use the Med setting and has the power to get up pet hair and fine dust up, low power better when using as handheld unit. I still use the Kirby for deep cleaning.\n\nThe biggest issue I have is the wall stand does not hold all the tools, 4 extras tools but only 2 slots, I will have to make a wall mount with dowels for the others."}, {"polarity": "pos", "name": "Benjamin McCaslin", "stars": 5.0, "title": "Crazy suction power", "content": "Since this is my first cordless stick vacuum, I really didn’t know what to expect in terms of performance. But I am extremely surprised by how much suction power it has given how light it is and how quiet it is.\n\nI have a Dyson corded upright that is 6-7 years old, and I feel like this thing has more suction power. No exaggeration. It’s also wayyyy quieter than I was expecting. I’ve only had it for a short amount of time, so I can’t yet comment on the battery life. But it’s advertised as having about an hour battery life on “Mid” power. I will rarely need more suction than this mid level because of how powerful it is, so I’m sure it will have all the battery life I need. On max power you can barely even move the thing on carpet because of how much suction there is.\n\nThe only thing I would change is to make the vacuum head a few inches wider. Takes a lot of passes to vacuum an entire room since the head is only 9-10 inches wide. But then again I really see stick vacuums as a convenient way to spot vacuum each day as opposed to deep cleaning every square inch of a room. So this is not that big of a deal."}, {"polarity": "pos", "name": "DGenie", "stars": 5.0, "title": "Love this vacuum!", "content": "Can't use a large vacuum anymore so bought this one. I'm amazed how well it works & how easy it is to change attachments. It picks up the seed hulls my bird throws on the carpet with one pass, better than the big one I was using. Now I need to hang it within close reach for I can only vacuum small areas each day.", "helpful": 1}, {"polarity": "pos", "name": "MotoPG", "stars": 5.0, "title": "Outstanding Vac - You really won't need another battery", "content": "It powers up at the medium power setting - Outstanding suction on the medium setting. No trigger to hold down, just turn it on and go! - If you run it on high, the suction is so strong it's hard to move around because its stuck to the rug. Ive found the high setting is fine for the attachment dust bunny tools and one in a while on hard floors and behind furniture, bookshelves, etc.. I was a bit worried about the the battery life - in reality it is a non issue. You will only use High Power once in a while and then switch back to medium power. Normally, after 15 or 20 minutes, I'm done with whatever Vac job and its right back on the wall recharging. Very easy to rinse off the parts and allow them to dry before reassembling the canister. Excellent cordless stick vac - I would buy it again."}, {"polarity": "pos", "name": "barbara", "stars": 5.0, "title": "Very convenient", "content": "This vacuum seems to be well built and has strong suction. I like having a smooth head for hardwood floors and a brush head for carpet. Emptying the dust bin takes multiple steps and correct alignment when reattaching to the vacuum cleaner. Simplifying this process would be an improvement. It is still new, so I don’t know about longevity yet which is important, but it is functioning well now. Also, the battery holds a charge for as long as I need to use it with battery time leftover."}, {"polarity": "pos", "name": "BN", "stars": 5.0, "title": "Better than Dyson", "content": "Purchased 2 of the jet 75s and the automatic dust bin station! The cordless vac replaced a dyson cordless that the wife had gotten as a gift but I found it was putting some of what it picked up back into the air so I found these and so far I am impressed! Have a weimaraner and 2 cats which shed a good amount! The auto dust bin station is a awesome addition as well as it has a hepa filter on the exhaust air! Even with the pet hair the bag in the station lasted for almost 2 months and that is with me cleaning in the morning before work and in the evening when I get home! Bought these for the wife but don't let her use them as she is to rough and only thing I will deem a negative is the connections for the tube are plastic and would be a weak point that could break if not careful! Did alot of searching and watching reviews on YouTube before purchase so do the same before making a choice!"}, {"polarity": "pos", "name": "BJ Schwab", "stars": 5.0, "title": "I love my Samsung", "content": "I LOVE my Samsung Jet 75. I chose it after reading reviews of several stick vacuums. I have 2 new dogs that are causing extra need for quick cleaning. I broke a Christmas ornament, swept up the larger pieces and then used my Samsung to suck up those tiny bits. It worked wonderfully. This is lightweight and easy to use. I do change the dirt container often, but that takes only a moment. It’s easy to charge and lasts for several cleanings. It picks up dust and dog hair perfectly. Great purchase.", "helpful": 1}, {"polarity": "pos", "name": "LesGo", "stars": 5.0, "title": "Pricey, but very convenient and easy to use.", "content": "My wife really loves this vacuum due to its light weight and maneuverability. For a larger place you might want to consider an extra battery (also very pricey) but oh so convenient. It reduces the drudgery of this important task and maybe, just maybe, we will do it more often. Can't believe how much cat hair comes up that we don't see normally. Hoping it will with some allergy issues in the house."}, {"polarity": "pos", "name": "Jason Kreuzman", "stars": 5.0, "title": "UNBELIEVABLE!!!", "content": "We love this vacuum. Great suction, tons of attachment that are all quality. My wife literally said “ this is my favorite purchase for our new house” and I 100% agree. Was going to get a Dyson, but so glad we went with Samsung.", "helpful": 1}, {"polarity": "pos", "name": "luzivette p.", "stars": 5.0, "title": "Better than dyson", "content": "Switch from dyson and it's way better, battery life is insane and you have the option to buy another one , suction power is better too highly recommend", "helpful": 3}, {"polarity": "pos", "name": "Warbird", "stars": 5.0, "title": "After Three Months - Excellent", "content": "Was more than pleased with what came in the box and how this vacuum works. The attachments are well designed and function wonderfully. We'll see how well it holds up over time.\nBattery life between charges is quite adequate at mid-power range which usually is plenty strong enough. Only used High Range once or twice.\nToo soon to rate regarding useful battery life over how many recharges."}, {"polarity": "pos", "name": "Hanson Electric", "stars": 5.0, "title": "Great Cordless vac", "content": "After reading the reviews on cordless vacs decided on the samsung. I am not disappointed. It is well made. The attachments have power drive brushes and works very well. Suction equals our large corded vac. Works great on both carpet and hardwood floors to pickup dirt and dog hair (we have two golden retrievers). The canister is easy to empty. Highly recommend."}, {"polarity": "pos", "name": "Adi", "stars": 5.0, "title": "The best stick vacuum out there.", "content": "It's the best vacuum we had. Suction power is great, battery lasts long time and it is replaceable. We have 1 extra battery just in case but we have never used it. Super easy to clean. Everything is great about this vacuum . We had dyson v11 for 1 year, it was not as good as samsung plus it broke down and dealing with dyson was a nightmare. Hours on the phone and months waiting for the replacement that never arrived.. We love our samsung vacuum."}, {"polarity": "pos", "name": "Feelin'mass", "stars": 4.0, "title": "Move over Dyson!", "content": "I love this Jet Pro! Move the heck over Dyson! Owned 2 Dysons in a 3 year period. Last one only lasted 1 year. This Samsung Jet Pro is made solid and the performance is bar none. Cleans and sucks just as good as the Dyson and cleaning the vacuum is a breeze. We have 4 cats so sucking up the litter is a daily event, up to 2 to 3 times a day, along with regular house vacuuming. We put this Jet Pro to the test and it reacts as if we just used it for the first time. So happy we went with this model. 4 stars is because it's been just a year, so will repost after the second."}, {"polarity": "pos", "name": "Lee from PA", "stars": 5.0, "title": "Very nice light weight cleaner", "content": "Great cleaning of hard floors. Does pretty good on carpet but not as deep as a good full size corded cleaner. I have a dyson 7 also and this cleaner overall is easier to use and cleans better. Only wish the battery lasted a bit longer. I think it is worth the extra money compared to other cordless cleaners."}, {"polarity": "pos", "name": "Mike T", "stars": 5.0, "title": "If this thing breaks, I'm gonna cry", "content": "Where have you been all my life! This is the greatest vac I have ever owned. Picks up dog hair off of rugs making them look new in minutes. We use it for everything and it outperforms consistently.\n\nOn HIGH, the battery lasts 15 mins but what you can do in 15 mins!!!!! Absolutely priceless."}, {"polarity": "pos", "name": "JY", "stars": 5.0, "title": "Great vacuum", "content": "What a great vacuum! I had a Dyson V8 and this vacuum is so much better. The filter is great and I doesn’t irritate my nose after vacuuming. I live in a small 500sq ft studio and the battery last for 3 cleanings for me before I have to recharge the battery. There are 3 modes and I use the middle power which is enough for me and not very loud at all. I would definitely recommend this to a friend."}, {"polarity": "pos", "name": "B. Elli", "stars": 5.0, "title": "Open box good as new", "content": "i got this unit as an open box used-acceptable, but it seems the only thing missing was the box because everything inside was sealed and bran-new untouched/unused. so i save almost 80$. it seems working well just out of the box. i still need to get accustomed to having all the weight on the wrist rather than with traditional vaccums"}, {"polarity": "pos", "name": "L.D.W.", "stars": 5.0, "title": "Christmas gift", "content": "I bought this as a Christmas present for my wife. Wait. Before you think I’ll of me, I know how it may sound but she wanted something like this. Anyway. It works great. She needed something light which this is. There are a lot of pros with this. The suction power, the weight, the number of attachments. The main con is how long/short the battery lasts. It’s probably about 30 minutes on high. It takes over an hour to charge. So the best thing to do is to get another battery right? Well that’s another con. A second battery cost $150.\n\nSo in conclusion, would I recommend it. Absolutely. Just know, it’s pricey and it does have it’s limitations but it’s also a great product."}, {"polarity": "pos", "name": "Katherine", "stars": 4.0, "title": "Very nice vacuum cleaner", "content": "The vacuum cleaner is a great purchase. Quick charge and powerful suction. The attachments are easy to use and cleaning it is a breeze. I would definitely recommend the only teasing it’s not 5 start is because I don’t ish it had a stand or something to place in upright, I don’t like the small wall mount it comes with."}, {"polarity": "pos", "name": "Gina", "stars": 5.0, "title": "Bought as housewarming gift", "content": "Bought this as a housewarming gift for my sister, who had everything packed in storage for months. She raved about the functionality of the vacuum and convenience of use compared to her giant Kirby. I’m not sure she’ll ever go back to the beast! Works well on wood, tile and carpet. Recommend!"}, {"polarity": "pos", "name": "Taylor", "stars": 5.0, "title": "Great!", "content": "I like this much better than my old dyson v6 absolute. Better battery, good tools, great suction with the adjustable settings. I really like how easy it is to clean compared to my old dyson. The canister spins the dirt into a single cyclone and I just find it easier to empty / maintain in between cleanings. Good design Samsung."}, {"polarity": "pos", "name": "R Taylor", "stars": 5.0, "title": "My stairs have never been so clean", "content": "I’d buy it a million times over - just to have the lightweight ability to keep my carpeted stairs clean. The attachments are amazing and it’s so portable and easy. I bought a shower caddy to keep all the attachments in and can easily carry both around the house when cleaning."}, {"polarity": "pos", "name": "William Parenti", "stars": 5.0, "title": "Better than a dyson", "content": "I have had two dyson vacs a 7 and an 8. This vac is far superior. aN added bonus is the battery is interchangeable so you can keep going on the major cleaning days.", "helpful": 1}, {"polarity": "pos", "name": "Anne Kenney", "stars": 5.0, "title": "Makes Vacuuming Fun...sorta", "content": "Lightweight. Easy to maneuver. Not as deep cleaning as my Miele Canister vacuum. But, doesn't take as much intensity from me. Hardest part is figuring out where I should hang the wall charger and put the accessories. I'd highly recommend the Samsung. I have multiple Samsung products. They never let me down."}, {"polarity": "pos", "name": "Jrss", "stars": 5.0, "title": "Worth the money", "content": "Our daughter asks to vacuum the house now, it took my wife 4 days after we had gotten it just to find something our daughter hadn't already done. Works like a dream on our hardwood floors, and with a quick swap of the cleaning head it makes quick work of the carpets."}, {"polarity": "pos", "name": "Christopher Vassiliades", "stars": 5.0, "title": "Nifty and Versatile", "content": "I love my new vacuum cleaner! The accessories allow it to be both a canister and floor vacuum. My only problem was that the dust deposit system didn’t come with the power plug! I had to deal with an operator who didn’t quite understand what I was talking about, and after 45 minutes on the phone, I was able to have it mailed to me."}, {"polarity": "pos", "name": "Craig in NYC", "stars": 5.0, "title": "A Great Cordless Option to Dyson", "content": "Great suction - 3 power levels - very lightweight without feeling inexpensive. Sucks up dog hair & cleans our low pile area rugs with minimum effort. Love the wall charging station. Excellent on hardwood. Run time all depends on what power level you use. Easy to empty & maintain so far."}, {"polarity": "pos", "name": "Bryan", "stars": 5.0, "title": "Great Alternative to a Corded Vacuum", "content": "I originally bought this vacuum to use in stead of my corded upright for quick cleaning. I was very pleasantly surprised to find that it works so well, it's the only vacuum I need from now on! No need to lug the upright or fight with the cord anymore. The Samsung Jet 75 has all the power I need and is perfect for vacuuming my whole house. Outstanding product and a great price!"}, {"polarity": "pos", "name": "shopper", "stars": 5.0, "title": "Worth every penny!", "content": "I thought this vacuum would become my everyday quick cleaning choice while my corded Dyson would be used for deep cleaning. Instead it has replaced the Dyson entirely. Convenient and powerful with good battery life."}, {"polarity": "pos", "name": "Barbara M.", "stars": 5.0, "title": "Works well!", "content": "This is a nice vacum it maneuvers well it has good suction power!\nMake sure you clean it out after each use .Light weight.Battery last awhile before recharging !\nA little expensive but wort the money!"}, {"polarity": "pos", "name": "Decius", "stars": 5.0, "title": "Great!", "content": "This is so light weight and fun to use. My only gripe with this is the battery drains quickly, especially on max mode. It's a great vacuum. No cord makes it so you have no excuse to not vacuum. I vacuumed the beds in my house and man it's gross. Definitely buy this and vacuum everything!"}, {"polarity": "pos", "name": "Tanya", "stars": 5.0, "title": "Great machine", "content": "This is awesome. Have been using for a couple of months. No issues with battery. Can vacuum pretty much entire house and do not run out. Will even do area rugs without sucking them up. Attachments are great too. Got this mainly for pet hair. I have killed a roomba and a shark and given up on smaller corded stick vacuums. This works better than all of those without the hassle of a cord."}, {"polarity": "pos", "name": "L. Hoffman", "stars": 5.0, "title": "Very decent vacuum for the price", "content": "This was everything I wanted in a cordless vacuum and I researched for weeks. It’s pretty quiet. Not a feature I cared about but my kids don’t have to scream at me to communicate above the noise of the vacuum. So if you’re interested in carrying conversation while vacuuming this one is for you!"}, {"polarity": "pos", "name": "Justice", "stars": 5.0, "title": "The Best!!", "content": "Very happy with this vacuum! It gets all crevices and corners that were typically missed before. Not too loud and easy to use. Battery could be a little longer. The box came like it seemed to have been opened and I was afraid they sent me a used product but it was still brand new inside.", "helpful": 1}, {"polarity": "pos", "name": "Robert W. Ebersole", "stars": 5.0, "title": "cleaner", "content": "household cleaning-works great-sure do like it", "helpful": 1}, {"polarity": "pos", "name": "Patricia", "stars": 5.0, "title": "Aspira muy bien", "content": "Aspira muy muy bien. Es cero ruidosa . La utilizo en succión media y la batería alcanza como para 40min de uso aprox. En succión máxima la duración de la batería es mínima , pero honestamente con succión media limpia bastante bien.", "helpful": 1}, {"polarity": "pos", "name": "cj330", "stars": 5.0, "title": "Excellent cordless vacuum", "content": "Excellent cordless vacuum! Suction is great with 3 animals on the house it picks up more then my corded vacuum. Battery on mid power last the whole 1400 sq ft house."}, {"polarity": "pos", "name": "junkbluz", "stars": 5.0, "title": "This is a great product.", "content": "Good suction, better than most wired vacs. Pricey, but put a larger battery on it and upstairs, main floor and basement can be done efficiently.", "helpful": 1}, {"polarity": "pos", "name": "GABE", "stars": 5.0, "title": "Best vaccum on the market", "content": "Dyson has a lot to learn from Samsung. The suction power is awesome and the feel is super sturdy and well put together"}, {"polarity": "pos", "name": "CleanChoice", "stars": 5.0, "title": "Battery life lasts way longer than my last cordless one", "content": "Different attachments is so nice, lasted a couple times vacuuming instead of just one. Gets the pet hair so good !"}, {"polarity": "pos", "name": "Steve", "stars": 5.0, "title": "Almost as good as my upright", "content": "This has great suction. It picks up almost as good as my upright with a fraction of the weight. It is so much easier carrying this up the stairs compared to my heavy upright. I love all the attachments."}, {"polarity": "pos", "name": "Thomas", "stars": 5.0, "title": "Love it", "content": "Love the suction power on max. My hardwood floors are spotless. Amazed at how well it cleans the sofa from dog hair too!"}, {"polarity": "pos", "name": "Brett", "stars": 5.0, "title": "Love cordless", "content": "I love this vacuum. If you have a corded vacuum you should definitely switch to this. It’s 1000 times better"}, {"polarity": "pos", "name": "DWard", "stars": 5.0, "title": "Ease of Use", "content": "We are using in a retail store. It is lightweight and easy to get around racks and into fitting rooms. No worry about cords getting caught on things. We tried it in one store location. Ended up buying two more for our other store locations."}, {"polarity": "pos", "name": "WRM", "stars": 5.0, "title": "Great suction and lightweight", "content": "Powerful suction and easy to maneuver. Attachments are great for different jobs."}, {"polarity": "pos", "name": "Greg Gutierrez", "stars": 5.0, "title": "Perfect for our shop", "content": "Tired of moving the plug from outlet to outlet to vacume the store. this works perfectly to vacume our small shop. with out having to move a plug around."}, {"polarity": "pos", "name": "Gigi and Lovey Mommie", "stars": 4.0, "title": "Wish I'd bought two batteries", "content": "Enjoying the cordless vacuum, just need a charged backup for those deep cleaning that require more time."}, {"polarity": "pos", "name": "Heather Chesmore", "stars": 5.0, "title": "Best vacuum but..", "content": "The stick vacuum is awesome, vacuumed a rug that gets vacuumed everyday and emptied two canisters full of debris. We ordered the cleaning station which later found out that Samsung doesn’t make the bags that go inside the clean station. Would buy the vacuum again but not the clean station unless Samsung comes out with bags for it."}, {"polarity": "pos", "name": "Alexandra Franco", "stars": 5.0, "title": "Love", "content": "I love this stick vacuum. Great suction, light and battery actually last the 60 minutes"}, {"polarity": "pos", "name": "Amazon Customer", "stars": 5.0, "title": "Nice vaccum", "content": "Battery could last longer, you have to vacuum fast. Other than that, it works great."}, {"polarity": "pos", "name": "Craig Englehart", "stars": 5.0, "title": "Great on Hardwood Floors", "content": "Purchased for our hardwood floors and its been great. Takes about 20 mins to vacuum all hardwood and battery lasts for entire time. Plenty of suction power and easy to manuever in tight places. Very satisfied so far."}, {"polarity": "pos", "name": "SARAH LEE", "stars": 5.0, "title": "Better than Dyson!", "content": "From battery life to suction power, the Samsung jet 75 outranks the Dyson!"}, {"polarity": "pos", "name": "Gretta Germroth", "stars": 5.0, "title": "A very powerful vacuum", "content": "It's easy to change accessories & empty the bin."}, {"polarity": "pos", "name": "Keith E Williams", "stars": 5.0, "title": "Excellent choice", "content": "Love this vacuum. Lightweight. Cleans well. Very easy to empty canister. Good battery life. Wall mount was easy to install. I would certainly buy it again."}, {"polarity": "pos", "name": "Gerhardt", "stars": 5.0, "title": "Does the job on carpets and floors.", "content": "This is a quality cleaning tool."}, {"polarity": "pos", "name": "PATRICIA D.", "stars": 5.0, "title": "Fantastic cordless vacuum.", "content": "Great sweeper . Better than the Dyson v11. That I had 3 that had to be returned. Suction power is unbelievable."}, {"polarity": "pos", "name": "Igor L", "stars": 5.0, "title": "Great vacuum, replaced my V10", "content": "Great vacuum, I didn’t expect it to be better then by older V10."}, {"polarity": "pos", "name": "SaJu", "stars": 5.0, "title": "It really sucks, but in a good way", "content": "Can't say we have much to compare to, but this vacuum is amazing"}, {"polarity": "pos", "name": "John.K", "stars": 5.0, "title": "Awesome", "content": "Awesome as expected. Highly recommend"}, {"polarity": "pos", "name": "Paul Brand", "stars": 5.0, "title": "Best Purchase Ever!", "content": "This vacuum is lightweight, has incredible suction and three powers to choose from. I tried using my plug in vac after using this and it felt like a larger heavy outdated vacuum compared to this one. Love it!"}, {"polarity": "pos", "name": "Chris Miyahira", "stars": 5.0, "title": "Worth it", "content": "I've used the V6/V8/V10. The suction on a Dyson is unmatched, but I would take this over any Dyson every day. You simply don't need that much suction and this thing is WAY lighter and more maneuverable. Don't be fooled by Dyson's branding. This is what you are looking for."}, {"polarity": "pos", "name": "Amazon Customer", "stars": 5.0, "title": "Just what I was looking for", "content": "I purchased another brand, it broke after 3 uses. Thus one has more suction and a better quality product. Very happy with it!"}, {"polarity": "pos", "name": "Nancy", "stars": 5.0, "title": "Samsung cordless", "content": "Super easy and convenient to use!"}, {"polarity": "pos", "name": "Book A. Holic", "stars": 5.0, "title": "Very nice vacuum", "content": "This is so much better my old Dyson V10. Everything is easier to use and manage on it."}, {"polarity": "pos", "name": "chris sherburne", "stars": 5.0, "title": "Buy it", "content": "Great vaccum the battery life can be challenging but overall I definitely don't regret the purchase"}, {"polarity": "pos", "name": "Kindle Customer 275", "stars": 5.0, "title": "Easy breezy vacuum!", "content": "This vacuum is super strong and easy to use! The battery lasts for days and is a game changer cleaning our stairs. Love it!!"}, {"polarity": "pos", "name": "Dana N pearl", "stars": 5.0, "title": "This makes cleaning fun and easy!", "content": "Love the light weight and cordless vacuum. I no longer mind the chore of vacuuming with this item."}, {"polarity": "pos", "name": "WC", "stars": 4.0, "title": "Battery apprehensionl", "content": "Love the compact and ease of use. Everyone warns me about battery life. Worried before anything happens."}, {"polarity": "pos", "name": "Bill", "stars": 5.0, "title": "Love this vacuum!", "content": "I find I'm tidying up much more frequently with this easy-to-use vacuum. We're amazed at how much dog hair it picks up. Love it!"}, {"polarity": "pos", "name": "Justin Millette", "stars": 5.0, "title": "Great Vaccum", "content": "Super quiet"}, {"polarity": "pos", "name": "Cindy Lou", "stars": 5.0, "title": "Perfect for what I needed", "content": "This has been a great vacuum for the cost ! I would recommend it !"}, {"polarity": "pos", "name": "Lauren Meese", "stars": 5.0, "title": "Great!", "content": "Excellent!!! Well engineered, powerful, easy to use, & even attractive. I love this product!"}, {"polarity": "pos", "name": "Richard Joiner", "stars": 5.0, "title": "Great product....most helpful tool I have purchased in a long time. I wish I had bought it sooner.", "content": "I am very pleased with the Samsung vacuum....just what I needed to get under furniture and speeds up the vacuming task."}, {"polarity": "pos", "name": "Bill Kirn", "stars": 5.0, "title": "Just great", "content": "Cleaning house and car", "helpful": 1}, {"polarity": "pos", "name": "Mr.Vito", "stars": 5.0, "title": "Nice vacuum cleaner", "content": "Very good"}, {"polarity": "pos", "name": "Zach Olander", "stars": 5.0, "title": "BEST Vacuum EVER!", "content": "Cannot day enough magical words about it!!!"}, {"polarity": "pos", "name": "Charles Adamson", "stars": 5.0, "title": "Makes vacuuming fun and a breeze!", "content": "This vacuum is amazing! Light weight, functional and worth every penny!!!!"}, {"polarity": "pos", "name": "Eva S. Herter", "stars": 5.0, "title": "Love my new Samsung Bundle Jet Cordless Stick Vacuum", "content": "Love my new Samsung Bundle Jet Cordless Stick Vacuum. Powerful and easy to move around"}, {"polarity": "pos", "name": "Ann Clark", "stars": 5.0, "title": "Just what I needed!", "content": "Easy to install the wall hanger/charger."}, {"polarity": "pos", "name": "Stanley D.", "stars": 5.0, "title": "Well built", "content": "Not as light as you might Imagine but still works great on stairs."}, {"polarity": "pos", "name": "Charlene pistorio", "stars": 5.0, "title": "Sooo easy, portable, quick and maneuverable", "content": "This is really great. So glad I made the purchase"}, {"polarity": "pos", "name": "Roland H Corriveau", "stars": 5.0, "title": "Well worth the money. Awesome", "content": "No cord very nice"}, {"polarity": "pos", "name": "Anselm Karas", "stars": 5.0, "title": "Samsung > Dyson", "content": "much better than my former Dyson v6"}, {"polarity": "pos", "name": "Constance Bailey", "stars": 5.0, "title": "Best vacuum!!!", "content": "Everything!"}, {"polarity": "pos", "name": "Thomas Nickolas Smith", "stars": 5.0, "title": "Good", "content": "It’s ok"}, {"polarity": "pos", "name": "Amazon Customer", "stars": 5.0, "title": "Excellent Cordless Vacuum", "content": "Play Video\n Excellent cordless vacuum. I used to own a Dyson, this vacuum is a Dyson 2.0, a complete improvement that picks up where they left off. It's aesthetically pleasing, like the Dyson, and incredibly lightweight. But unlike the Dyson, it actually works, with very strong suction power (unlike the Dyson). Indeed, the suction power on this almost matches my corded commercial vacuum. This vacuum is whisper quiet, charges quickly and has incredible battery life. It's a little pricey, but honestly well worth it, especially compared to the Dyson. It comes with all the attachments you could possibly need: carpet, hard wood, crevice, small surface and a couple angle attachments. This vacuum replaces the standard upright and a hand held. Great for cleaning the house and car.", "helpful": 16}, {"polarity": "pos", "name": "K. Taylor", "stars": 4.0, "title": "Possibly my favourite stick vacuum", "content": "This is my third stick vacuum, having previously used vacuums from Orfeld and Bissell, and while the other two were both very good in very different ways this one, I feel, is juuuuust right.\n\nMy lightweight Orfeld is perfect for grabbing whenever I spot a stray hair, because it weighs almost nothing and feels like no effort at all. Conversely the Bissell was considerably heavier but considerably more powerful, so it was more of an effort to use but did a better job.\n\nThe Samsung offers the best of both worlds. It’s a little heavier than my Orfeld but significantly lighter than my Bissell, and - crucially - it also seems to be almost as powerful as the Bissell. Level three power with the Samsung is more than I’d ever need in my apartment with its laminate floors and no rugs. Lightness and power. Who could ask for more?\n\nIt also feels *smoother* than both of my other sticks. I can’t see any obvious differences in the construction of the brush head so I don’t know why, but it just feels nicer to push back and forth than both of my other vacuums. It’s a real pleasure to use.\n\nFinally it looks great. I don’t get all hot and bothered about the looks of a vacuum cleaner, but this one is very sleek and cool looking. Nice styling.\n\nNow, I have just one complaint that’s going to cost the Samsung a star: it won’t stand up on its own. My Orfeld vacuum has a clever clip in the head that allows you to finish vacuuming and just leave it standing wherever you want, and it’s one of my favourite features. It may not seem like much, but there’s just something about finishing the job, dropping the vacuum where it lays and wandering off to do something more fun that fills me with glee, and I wish I could do the same with the Samsung. Instead the Samsung has a docking station that can be attached to a wall. That’s the only way it’ll stand, and if you don’t want to drill into a wall you’ll have to just lay it down flat somewhere.\n\nIs this a dealbreaker? Of course not. This is a great vacuum, better in many ways than my Orfeld. I just wish Samsung had included that one killer feature for people who celebrate laziness as much as I do. If it would stand unaided this would be a clear 5 star.", "helpful": 9}, {"polarity": "pos", "name": "Yashahime", "stars": 4.0, "title": "Changing the vacuum game", "content": "As someone who is used to using an old school corded vacuum, this cordless stick vacuum is a game changer.\n\nPros:\nThis vacuum is fairly light, which makes it easy to use one-handed and to carry up and down the stairs.\nI love that there is an attachment for every floor type and situation. All the attachments are easy to connect and remove from the vacuum. My home has mainly hardwood floors and then tiles for our kitchens and bathrooms, so the soft brush works great for both. For all the tight areas between my furniture, the long crevice attachment is the perfect tool.\nThe vacuum has 3 suctions levels that you can easily adjust on the digital display\nThe dust bin is super easy to empty. The dust bin is supposed to be fully washable but I haven’t had a chance to do so.\n\nCons:\nThe battery is bulky so it does add a bit of weight to the vacuum. The vacuum also only comes with one battery\nThe charging station that comes with the vacuum has space for the smaller attachments. But there’s no space to place the 3 bigger one. The station comes with the parts to drill it into a wall or you can have it sit on a desk. It would have been nice to have an option for a full floor setup.\nI have a few different rugs around my house and depending on the rug type and size the suction is too strong and requires too much force to move the vacuum.", "helpful": 9}, {"polarity": "pos", "name": "Jessica", "stars": 4.0, "title": "Almost perfect vacuum", "content": "Pros\n-Excellent suction\n-zippy and easy to maneuver\n-lasts long enough for most cleaning uses\n-works perfectly on tile with no debris kickback\n-great with pet hair and cat litter\n-easy to empty canister, hair doesn't stick!\n-the quietest vacuum I've had\nCons\n-Has a hard time with certain rugs\n-Mount doesn't have a spot for every attachment\n\nI am obsessed with finding \"a better vacuum\" We currently have 4 vacuums and two mop vacuums because I am always wanting something better (they range in brands like Bissell, Shark and Dyson). This is our first stick vacuum and I am in love! I am actually going to start getting rid of our vacuum collection because this vacuum replaces them.\n\nThe suction on this is great. I used my Dyson Ball to very thoroughly vacuum a plush area rug that sees a lot of animal and kid action. I followed it up with using this Samsung Jet and was shocked and excited at how much pet hair and fine dust it picked up, directly after being vacuumed well by another!\n\nOur house is predominately tile and I have always struggled to find a vacuum that could handle it. Some vacuums struggled picking up fine dust or bigger particles (I'll sweep after vacuuming and be disgusted at how much was left behind by the vacuum). All vacuums I've had have always kicked things around when using the roller brush, like small pebbles or cat litter (even the Dyson which was superior on my tile than anything else I tried). I used this Samsung on the medium setting and got to work and nothing got kicked up! I even tested it around our litter boxes and seamlessly went from hard floor to litter covered rugs and not once did I feel, see or hear litter getting sprayed from the rolling brush. I am seriously still in awe. I did the broom test after I vacuumed and was pleased to see that my broom didn't discover any fine dust left behind.\n\nAnother thing I vacuum are my blinds. I was worried that this would be harder to use as I'd have to lift the whole thing up as opposed to the hose of the upright, but I discovered that it was actually easier as I wasn't fighting against the weight of the upright vacuum nor having to make sure I moved the vacuum with me. The brush attachment was perfect at getting the blinds dust free\n\nThe attachments are all useful and work well. They snap on and off with easy and feel sturdy when on. The charging station has a convenient location to store them.\n\nThe battery life is adequate. I can get most of the main rooms of my house done in one charge, toggling between medium and high. I have yet to have it die and leave me in a lurch cleaning wise, especially with planning. I do plan on getting an extra battery though for convenience sake in case I have ambitious cleaning days.\n\nIt does really well with pet hair and litter. I have two large shepherd/lab mixes and a long hair and short hair cat and this vacuum and canister handle the hair and mess really well. The dirt canister does a great job at separating the hair so that it doesn't prematurely block the intake which means I can go a lot longer without having to empty it. Emptying it is super easy and clean too, the hair slides off easily and I have yet had to reach in and touch it to get the hair out the way I've had to in \"touchless\" emptying canisters on other brands.\n\nIt's also easily the quietest vacuum I have had. Its still a vacuum, its not whisper quiet, but I can actually have conversations while using it and my husband can easily hear the TV.\n\nThe biggest downside to this vacuum is that it comes with three power-heads but no way to store two of them. Ideally these would click in the charging station somewhere, but I'd even settle for them having the right shape or notches to allow them to me more easily and securely hung elsewhere.\n\nIt also is a bit frustrating to use on rugs, particularly runners and smaller, lighter rugs. It does really well on my 5x7 carpet rug and it does a great job on indoor.outdoor rubber based rugs of various sizes, but the roller seizes up and it becomes hard to push on runners and thinner smaller area rugs, even on the low power setting. Its not a total deal breaker as its still utilizing the suction, and I do appreciate that it smartly stops the roller to avoid damage, but I do wish it could be a bit more rug savy.", "helpful": 7}, {"polarity": "pos", "name": "PenKay", "stars": 5.0, "title": "Best design for a stick cleaner we've ever used", "content": "Samsung Jet 75 Complete Stick Lightweight Cleaner\n\nHonestly, I swore I wouldn't get another stick cleaner since everyone we have used, including some pricey brands, has had problems of one kind or another. The thing is, we've got cats and hardwood stairs and there simply is no convenient substitute for getting the hair that accumulates at the corner of every step, and corners in general, where a robotic vacuum can't quite reach. Since we've never been disappointed with our Samsung electronics and appliances, I thought we'd give their stick vacuum a try. I've got to say that this is the easiest and most effective one that we've ever owned. It's got great balance and isn't tiring to hold; there are three suction levels which saves both battery charge and is a lot quieter if all you are doing is getting loose hair and dust; the attachments are modular and can be used with or without the extension tube; it's easy to change attachments but they still lock into place securely; and finally, the charging cradle can be mounted on the wall and the whole unit glides right into it and lifts smoothly out again. There are three power brush attachments: one for furniture, one for area rugs and carpet, and one that does fantastic at getting dust and hair off hardwood and tile floors. Honestly, this model makes me not dread having to use it which is saying something because I really don't like vacuuming. Highly recommend.", "helpful": 5}, {"polarity": "pos", "name": "Matthew Valdez", "stars": 4.0, "title": "Powerful and Efficient", "content": "I have used vacuums from Dysons and Shark, but never from Samsung. I was eager to see how the Jet 75 performed and I was not disappointed. The JET 75 came with a plethora of attachments, more than any other vacuum before, and it provided an incredibly strong suction. Within the first week of using the vacuum, I came to the conclusion this is my favorite vacuum I own.\n\nMy only complaints about the JET 75 is the battery life, charging, and not being able to leave the vacuum standing. I wish the battery last just 1 more day longer. Having a pair of Aussie's, my house becomes inundated with hair in no time. Charging the JET 75 is kind of a pain to me because I have not attached the unit to the wall so it requires me to remove the battery when I need to charge. Otherwise, you can just slip the unit on the charging station. A small issue is the JET 75 can not be left standing up on it's own, I constantly have to find a place to lean it up against. Small issue but it is something.\n\nEnough of the complaints, I just want to say the suction and power of this vacuum is the best I've used. On top of being quite powerful, it is relatively quiet compared to my other vacuums. I believe my dogs will agree with me as well as they seem not to be as scared of the JET 75. Cleaning the vacuum pretty easy and emptying the bucket is a breeze. It is pretty big container as well. The roller has no problem dealing with all my dog hair and leaves no tangles. The wheels get hair in them but they are incredibly easy to clean so no problems there. Craftsmanship on the vacuum is top notch, it really does feel premium.\n\nOverall, it is a phenomenal vacuum with a few quirks. Fortunately, the quirks don't take away from how good the vacuum is.", "helpful": 4}, {"polarity": "pos", "name": "CodeMonkey", "stars": 4.0, "title": "Impressive Suction and Features", "content": "This Samsung Jet 75 is an impressive vacuum. It has great suction and a long run time too. Although on some carpet, full suction is too powerful. At full power, I can vacuum a few rooms, about 20-25min. At the lowest power, it will last up to 60 minutes with no motorized tools.\n\nWe have 3 dogs and a cat, so the powerful suction and the 5-layer HEPA filtration system is critical features that really make a difference.\n\nA cool feature, is that you don't have to hold down as trigger while you vacuum, just press the power button.\n\nI love that the dust bin is able to be put in the dishwasher - I have never seen that before!\n\nThe attachments are useful, I primarily use the crevise tool and combination tool. There is also the flex tool, mini-motorized and a soft brush attachment too. It would be nice if all the tools could be attached to the stand.\n\nI love that the dust bin is able to be put in the dishwasher - I have never seen that before! An impressive Stick Vacuum!", "helpful": 4}, {"polarity": "pos", "name": "Ann", "stars": 4.0, "title": "powerful suction, brushroll is easy to remove and clean, almost", "content": "The vacuum has powerful suction and works well. It has wall charger and you can attach two of the tools to it, but unfortunately, the other two tools do not have a home. The suction is really powerful, and it means it works well on just medium for most of the places I need to clean. I love how easy it is to clean roller from the hair that wraps on it. It completely pulls out of one side of the cleaning head and then you roll the hair off the roller. Unfortunately it does not come out on the other side, so there are few hairs that wrap themselves where the rolling brush attaches to the head. To empty the canister, you need to remove it completely - and then you screw off the top and pour it out. It is not as nice and easy as on my old Dyson V8 where you just pull on the lever and everything falls down in the garbage can. It is a bit fiddly to put the cover back on because you need to align it properly. I do not like how this works. Unlike Dyson, you do not need to hold the trigger all the time - it is easier this way, but you end up wasting power when you need to move stuff out of the way or something.\nOverall, I like the vacuum.", "helpful": 4}, {"polarity": "pos", "name": "B Wallis", "stars": 5.0, "title": "Great choice, lots of attachments, and quiet!", "content": "I had a stick vacuum years ago and it was a big disappointment. Technology has come a long way and I wish I had looked for one sooner. I wouldn’t give up my traditional vacuum, but this thing comes in handy for quick clean ups and not tripping over a cord is a huge plus.\n\nOur home has primarily hardwood and tile flooring and the soft action brush does a good job of picking up debris. We have a houseful of animals – dogs, cats and birds and it works great for cleaning up after all of them. The turbo action brush works well on area rugs, but I find I need to turn down the power when cleaning smaller rugs or it tries to suck them up. Battery is adequate for light cleaning of two large rooms. Battery lasts a little longer if you don’t run it on high all the time. The attachments do not lend themselves well to cleaning carpeted stairs, which is something I was hoping for. The crevice tool worked fine around the edge, but the only attachment that worked well on the stair treads is the turbo action brush, which is too large so it is awkward. The mini motorized tool works fine on furniture, but not the stairs. The crevice tool is extendable which allows easy reach to higher areas without worrying about a hose.\n\nThe unit comes with a wall mount bracket for charging and some attachment storage. The model I have includes 6 attachments, however, the mounting bracket only accommodates 4 of them. The unit has three different power options, none of which are very loud. This model does not have a light, which you wouldn’t think would be a big deal unless you are used to this feature. The canister is easy to remove when it needs to be emptied and is washable. It also includes a washable ultrafine dust filter. Samsung makes an identical vacuum with a wet brush as an accessory. I wouldn’t hesitate to buy another Samsung, although if I had to, I’d buy the one with the wet brush.", "helpful": 3}, {"polarity": "pos", "name": "Hairy Potter", "stars": 4.0, "title": "Very Pleased Overall, But It Isn't Perfect", "content": "This vacuum replaces a Dyson Ball vacuum which I used for over a decade. I am very happy with it overall. I use a robotic vacuum as my primary vacuum and this is for quick jobs. However, I would be happy to use this as my primary vacuum if I didn't have the robot.\n\nPROS:\n(1) Lightweight\n(2) Adequate battery life to handle the entire job, even when used on the highest power setting (I only use the highest setting)\n(3) Excellent suction ability\n(4) Convenient wall mount for storage/charging\n(5) Nice selection of accessories included\n(6) Very easy to clean brushes...if you live with somebody who has very long hair, you know how important this is!\n(7) Battery charges quickly\n\nCONS:\n(1) No place to store some of the accessories\n(2) Bin is not convenient to empty compared to most other vacuums\n(3) Not good for sucking up larger items, such as pet food. It can handle cat litter, but nothing larger than that", "helpful": 2}, {"polarity": "pos", "name": "Phoenix", "stars": 4.0, "title": "Great for Hard Floors", "content": "We don't have a single spot of carpet in our home. It's all marble tile. This does an excellent job of vacuuming. No matter how much I sweep I seem to leave dirt/dog hair behind. This takes care of the problem. It can't do the house on a single charge but I don't usually clean the whole house at once anyway. It's also great for when the dogs track sand into the house. Absolutely no problem with the suction power. Very powerful without making a huge racket. Very easy to use. Definitely recommend if you're looking for a stick vaccum that has the suction you need to actually get your floors clear of dirt and debris.", "helpful": 3}, {"polarity": "pos", "name": "Justin", "stars": 5.0, "title": "1 of the best vaccums I've tried. It picked up dog hair that I didn't even see & great battery life", "content": "This vacuum has more suction then another vacuum I've tried. It picks up everything in the floor and I do mean everything including stuff you don't see. I went over the floor with my other vacuum and then this Samsung came in the mail, so I tried it to see how well it would do.\n\nTo my surprise it got up stuff that I didn't even see. Stuff that my other vaccum didn't get off the floor. This is with the battery on low because I never charged it from when I got it. When the battery is actually charged it becomes a monster lol.\n\nHowever this vaccum has alot more power then the other vacuum I tried that is similar to this one. I use this one on medium and it picks up everything.\n\nIt also came with alot of attachments like ones for wet floors, 1s for hardwood/Hard floors, one that gets in between cracks and it extends out which suprised me but works really well.\n\nThe vaccum cleaner canister that collects the dirt is alittle harder to get back on and off then the other vaccums I've used but nothing major.\n\nAlso this vaccum doesn't have a light for some reason. 2 of the 3 vaccums ive used didn't have lights which really comes in handy imo.\n\nI also had trouble getting the battery in the charger. I thought it clicked in like most batteries do but Nope. This one just sets in place and doesn't snap in. I'm changing the battery with the deck charger and not sticking the whole vaccum in the charger which also leads to another issue. Since I don't have the charger installed on the wall and don't have the vaccum attached to the charger I have to lean the battery charger against something or the battery will fall out because it doesn't click in.\n\nThe battery information is on Page 17 of the manual for those who want to know.", "helpful": 2}, {"polarity": "pos", "name": "Roni", "stars": 5.0, "title": "Powerful vacuum with the right accessories", "content": "KEY FEATURES\n3 Power Levels\nDiagnostic Indicators\n99.999% Filtration\nOutstanding Battery Runtime\n\nLong story short, the Samsung Jet 75 is an excellent stick vacuum with an impressive runtime of up to 60 minutes.\n\nJet 75 includes a good number of accessories. I have stick vacuums from Samsung’s primary competitor and this vacuum includes more options than a similarly priced competitor’s model. Included with the kit are: Mini Motorized Tool, Crevice Tool, Brush Tool, Turbo Floor Tool, Soft Motorized Floor Tool, Flexible Extension Hose, and a Wall Mount. All the accessories have a nice, premium feel and are easily interchanged, that latch and click solidly into place.\n\nAt 6 pounds, the vacuum can be used for extended periods of time without feeling overly heavy or burdensome at the end of sweeping. One of the best features of the vacuum and its attachments is that the turbo brush heads can rotate up to 180 degrees. This easily allows the brush head to go under furniture for easy cleaning. A VERY NICE FEATURE. The vacuum has an on/off button that controls the cleaning modes and power of the unit. Low, Medium, High, and Wet. It must be noted that the Jet 75 does not include the accessories to utilize the Wet cleaning mode of the vacuum.\n\nI had never given it any thought about not having a trigger to turn the vacuum on and off. This is the first vacuum without a trigger. I must admit, now that I don’t have a trigger for control, I like it better than I thought. The ability to change the power level with just a button click and not having to hold down the trigger is a welcome change. I don’t think I would want to go back.\n\nSamsung claims up to 60 minutes of runtime out of a fully charged battery (recharging can take up to 3.5 hours). While I originally thought that was just a marketing claim, I can say that goal is not out of reach. The majority of my home is hardwood. I can vacuum all my hardwood and tile floors, using the Medium power setting and the soft, motorized turbo brush, and still have 2 out of 3 bars remaining on the battery. I have more than enough power left to vacuum the remaining carpeted rooms with the Turbo Motorized Brush without needing to charge between. Very Impressive. This is something I cannot get anywhere close to with my current competitor’s stick vacuum.\n\nNEGATIVES\nWhile I have no issues using the vacuum, taller members of my family seem to feel the vacuum could be a little longer / taller. Family members over 6 feet seem to think they need to bend over more than competitor’s products to keep the brush heads in proper contact with the floor. However, those of us not more than 6 feet tall, don’t seem to have any of those issues. So, to be fair to Samsung, it could just be a user issue.\n\nWhile I really like the soft, motorized brush head for my hardwoods and tile floors, I feel that it has some issues sucking up debris on the backward sweeping stroke. Using the soft brush head on the medium power setting, the motorized tool seems to do a better job at removing dirt and debris from the hardwoods on the forward cleaning stroke than when pulling it back toward me while sweeping. Again, to be fair, this could possibly be remedied by using the High-power setting. But that would prevent me from being able to clean an entire story on a single charge. I must point out, that this tool has zero issues getting that dirt and debris on the forward stroke. So, I believe it to be a function of the rotation of the roller and the way it covers my hardwoods.\n\nCONCLUSIONS\nI like this vacuum. It is considerably quieter than its competitor and delivers an impressive amount of runtime off a single charge. The vacuum does a good job on hardwood, tile, and even carpet. The Motorized Turbo Brush will pick the carpet’s nap back up just a well as my full-size electric vacuum. Based on the included accessories, the multiple power levels that increase usable time, and good overall build quality, I have no issues recommending this over Samsung’s competitors.", "helpful": 1}, {"polarity": "pos", "name": "Family7", "stars": 5.0, "title": "Powerful. Comfortable. Effective.", "content": "I have owned so many different types of vacuums in my past, some were great and some were not. This particular vacuum from Samsung is exceptional! First of, it is lightweight, and even though it is lightweight it is still quite durable. Secondly, it is absolutely powerful.. it grabs practically anything and everything and does so with ease; as compared to ALL of my cordless vacuums, this one is the best and most powerful, by far. Third, the battery on this lasts for much more than i need it to (about an hour). It is also super easy to clean and maintain. It isn't too loud at all. And it looks beautiful and space efficient. I would definitely recommend this for any household.", "helpful": 1}, {"polarity": "pos", "name": "mac girl*", "stars": 5.0, "title": "Light!!", "content": "I love this vacuum. I have a spinal injury and getting out my heavy full size vacuum has become more and more difficult. If you look at the bottom of my photo, I attach the accessory directly to the vacuum and left off the stick. This is ideal to clean baseboards, vacuum up dust, vacuum out my car, clean up quick spills. I can’t believe how often I use it. Suction is powerful and I can lift this light vac without pain or fatigue. Even with the larger attachments, it is powerful, but not heavy.\nI do wish the design on the dust cup were easier to empty. You need to remove the dust cup, then pull out the interior filter, then empty and reassemble. It’s a minor gripe and not worth deleting a star.\nVery happy with this lightweight vacuum. It’s ideal for anyone who lacks strength due to injury or age."}, {"polarity": "pos", "name": "DaveG", "stars": 5.0, "title": "Terrific Cordless Vacuum", "content": "I bought this 1 year ago from my local big box store. I have used it daily since then. Sometimes just a light pickup, other times whole apartment cleaning. I have to say it is a joy to use. Powerful enough for my needs (no pets no kids) and the battery is more than sufficient to do the entire apartment with carpet and hardwood floors. The battery is beginning to show a little loss of power but I can still get 20 minutes on mid or low. The attachments are great. Well thought out and very useful. Highly recommend this one."}, {"polarity": "pos", "name": "dallase", "stars": 5.0, "title": "IN LOVE", "content": "This thing is amazing. I actually find myself grabbing it and sweeping randomly throughout the week now when I see something small on the floor. Previously I would wait until the weekend because it was a chore to haul the big plug in vacuum out.\n\nThe suction power is top notch. Make sure you clean the filter once in a while, you will start to loose suction power as it gets dirty.", "helpful": 1}, {"polarity": "pos", "name": "hyoseok choi", "stars": 4.0, "title": "Vacuums great but wet setting 😬", "content": "We love this more than the Dyson we had. Suction is strong and battery lasts long.\n\nThe only complaint is that the wet setting isn't too great and there are two reasons why:\n\nFirst, there isn't a tank so you have to either spray the floor or re-wet the cloths. The disposable clothes dry too fast, they only wet a bit and then they dry out in a minute.\nSecond reason is that to remove dirt from floor you really need to apply pressure... a regular mop cleans better.\n\nOther than that, vacuum is easy to clean."}, {"polarity": "pos", "name": "Amazon Customer", "stars": 5.0, "title": "Best of best", "content": "Undoubtedly nothing else can beat this. I wish I could give it 10 stars. Dyson is a rip off. Rest have nowhere quality that this one has. Amazing quality, lots of add on parts, super light, super quiet, very powerful. No cons by no means."}, {"polarity": "pos", "name": "PartyofFive", "stars": 5.0, "title": "Lightweight", "content": "This vacuum is super lightweight and can get into all of the hard to reach corners in my home. Very good battery life and the basket is easy to remove and dump. Absolutely no complaints about this vacuum!"}, {"polarity": "pos", "name": "Dylan", "stars": 5.0, "title": "Don't sleep on Samsung vacuums!", "content": "This vacuum is a powerhouse and overall value for what is brings. 200 air watts of suction out of a stick vacuum is top tier only beaten by 2 of the Dyson models which cost $799.99 and gives you 15-30 air watts more suction. Removable battery is amazing and Samsung is well known for their battery performance and I can say from use that until its about to die you do not notice the suction/performance degrading. I am easily able to clean my Home on a single charge but medium/larger Homes may need to invest in a second battery which is not really a big deal and easily attainable from Samsung. If you have a lot of carpet and are utilizing the highest suction the battery will deplete faster maybe 15-20 minutes of use. I have medium pile carpet and it has no problem getting everything from the carpet. The filter is also top tier in efficiency, it really does not get much better. The vacuum is easy to maintain/clean which is important to me, I literally just soak most of the dust canister and filter once a month (Follow instructions for details). I really believe that this is the best performing vacuum for features and price on the market."}, {"polarity": "pos", "name": "santos", "stars": 5.0, "title": "Recommend!", "content": "I'm super happy with it. We have a split level home with two dogs and a cat. We have hardwood flooring and some area rugs. The MID setting works great for most of the home and as long as i keep up with my cleaning I dont have to use the MAX setting much. The battery life has been great so far but I like that it's replaceable when that time comes. I also use it on low for my couches with Arm & Hammer powder it leaves my home smelling great!", "helpful": 1}, {"polarity": "pos", "name": "Sim", "stars": 5.0, "title": "The perfect cordless stick", "content": "I love this cordless stick. It has so much power and is always ready when I needed it. I wish the battery lasted a bit longer and replacements weren’t $150. Hopefully the included battery will last several years."}, {"polarity": "pos", "name": "Vickie S.", "stars": 5.0, "title": "GREAT VACUUM", "content": "This is a GREAT battery operated vacuum. I'm a Dyson fan through and through - but - I've got to say this unit is slightly better. Both are great (I own both), but the edge goes to Samsung."}, {"polarity": "pos", "name": "Jim Hickman", "content": "I've never had a vacuum cleaner that, on the highest setting, has almost too much suction. A friend of mine has a much more expensive big-name-brand unit -- but it doesn't have this kind of power.", "helpful": 1}, {"polarity": "pos", "name": "Mel D'Souza", "content": "Great design and performance. Hoping its built to last."}, {"polarity": "pos", "name": "Amazon Customer", "content": "Great!"}, {"polarity": "crit", "name": "Amazon Customer", "stars": 1.0, "title": "Update after one year: the motorhead brush broke three times in a year", "content": "Best thing since sliced bread. I am already a samsung fan so I knew it was going to be good. I owned three Dyson vacuums before, and two of them are wireless ( v8 and v10). This samsung completely blew them out of water.\nThings I think this samsung is superior:\n1. It can be used with samsung clean station, which is a godsend for people dreading cleaning the dust bin.\n2. I like the samsung interface better.\n3. It has three heads for the price. For same price Dyson will give you only two.\n4. Charging station is better designed and is more stable after installation.\n\nOnly minor thing to complaint is that the outer package seal seems opened. Everything inside seems intact and properly sealed and looks brand new; so not going deduct one star just for that.\n\nI only used it for one day. I will update if I have complaints in the future.", "helpful": 65}, {"polarity": "crit", "name": "Raminak", "stars": 1.0, "title": "Looks '\"returned\" or \"refurbished\" as you expect here", "content": "It looks as if it has been returned once or twice. The tapes were retaped, there were few specks of dust in the suction casing. Off scratches. Ended up buying one from Samsung directly.", "helpful": 45}, {"polarity": "crit", "name": "Artur W. Fay", "stars": 1.0, "title": "Hunk of junk - don't waste your money", "content": "The machine only works for a few seconds at a time, then quits and you have to restart the thing - suction is minimal at best. I wouldn't recommend this one to anyone.", "helpful": 11}, {"polarity": "crit", "name": "Amazon Customer", "stars": 1.0, "title": "They do not honor warranty", "content": "My vacuum had an internal part to break after 6 months. A part that is covered under the warranty. I have called Samsung 5! different times. Each call is an hour at minimum. Every single time they tell me my part will arrive in 10 business days. 2 weeks after every call, I get an email that says I can buy the part if I want another one! The representative always tell me it's covered then I get an automated email saying it's not. Beyond frustrating. I have a 6 month old $500 vacuum that is worthless.\nAlso before the part broke, the wheels on the roller head drove me crazy. You have to clean the wheels after each time you vacuum or it will leave black streaks all over your floor. I am used to buying a new Dyson every year because that is how long they last which is unacceptable, but at least they do last a year.", "helpful": 5}, {"polarity": "crit", "name": "Amazon Customer", "stars": 1.0, "title": "Samsung discontinued dust bag for the vacuum dust removal system.", "content": "Samsung will no longer provide the dust bag for the dust bin removal system. It is a good system, which minimized the dust when cleaning the debris container but Samsung will not make any replacement dust bag. Samsung abandon support for this product yet continues to allow it to be on sale.", "helpful": 8}, {"polarity": "crit", "name": "Tamra Riley", "stars": 3.0, "title": "Cannot find replacement bags", "content": "I love this vacuum I love the fact that it holds a charge for me to vacuum my whole house I do have an issue with it picking up dog food off the floor it does not seem like it wants to do that the main issue I have is that I cannot find replacement bags so I just had to hand empty my dust bag into my garbage can which then created a bunch of dust in my house no on one note it does hold a lot of dirt and when I say dirt I mean dog hair I could not believe how much hair came out of that little bag. Samsung should start up a club for auto re-ship for the bags at a discounted price I figured since I paid $600 for my vacuum and dust collection unit they should at least do that.", "helpful": 4}, {"polarity": "crit", "name": "Lt.", "stars": 2.0, "title": "Not worth it", "content": "I should’ve paid more attention to the reviews mentioning their vacuum arrived looking used. Maybe this thing works better when buying from Samsung. Vacuuming on medium does nothing. Not good on my tile floors. Can only use high setting on carpet. Does ok picking up litter on rug, but terrible on non-carpeted floor.\n\nI did a test where I vacuumed an area for 20 min, then used a large lint roller over the same area. Pet hair and my hair not picked up properly. I’ve done this multiple times, same result every time.\n\nI do like the vacuum handling edges or corners with the small attachment. At least that works decently.\n\nYou can’t just plug this vacuum in to charge. You need to hook it up to the wall charger. This thing won’t stand up on its own. I’ve only had this thing for 6 months and I don’t expect it to last long. I can get at most 15 min. battery on medium, how on earth could you get 60 min. as mentioned in the product details?", "helpful": 3}, {"polarity": "crit", "name": "joseph k.", "stars": 1.0, "title": "Received used product.", "content": "Returned twice. Kept getting used product.", "helpful": 9}, {"polarity": "crit", "name": "A. Jade", "stars": 2.0, "title": "Just not for me", "content": "I really want to live this vaccuum. I do. It has amazing suction and battery life is great, it was easy to put together and feels fine on my hand. I love those it turns on and stays on without having to hold down the trigger. It goes really flat for easy vacuuming under couch and chairs, beds etc.\nNow the cons. Which for me unfortunately outweigh the pros. The suction is so strong it gets stuck and has to be turned off and restarted even on the lowest pile rug, like a 1/2 inch even on the low setting. This is annoying as i have to keep taking hand off trigger to restart. It also clogs on small debris like a a piece of cereal or paper etc that my Dyson v8 or 11 can just suck right up with no issue. It doesn't automatically adjust the suction for the various floor types. The last and worst reason for me. It is LITERALLY a pain to empty the dust bin. It has to be popped off the vaccuum completely then the filter taken off which is supposed to be easy but after a couple uses it sticks and has to be pried open, it has given me a nasty static shock on more than 1 occasion and it's a mess to dump. I dread it. It takes away all the joy I feel seeing the bin fill up that I came to love on my Dyson. The value was nice and the vaccuum has a lot of pros maybe if you're able to wash the filter and dustbin after every use it might be a good fit for you and you just want it for like pet hair n dust no larger debris. It just doesn't work for my needs unfortunately."}, {"polarity": "crit", "name": "JLP", "stars": 1.0, "title": "Battery doesn't last", "content": "This would be ideal for a quick cleaning, not full house. For the price the battery should last longer than 9 minutes. It takes 2-3 hours to fully charge", "helpful": 4}, {"polarity": "crit", "name": "Allen Foote", "stars": 1.0, "title": "Sucks but it also....sucks", "content": "It has great suction. That's about it. Battery runs down super quick, couldn't even do the steps without it dead. When you attempt to store it...have to plug it into the charger. If you try to set it aside it just drops to the floor. Attachments are plentiful, nowhere to put them all,have to hangup to the box. Summed up...after a redesign by the people the assemble the product and not there engineers it might be a good buy. It's clearly made by someone that doesn't personally use a vacuum lol.", "helpful": 1}, {"polarity": "crit", "name": "S. Traill", "stars": 2.0, "title": "Spare battery not available - from Amazon nor Samsung", "content": "Need spare battery VCA-SBT90/XAA - not available ! Not listed on Amazon. Samsung web site states - NO online sites available. Tried Samsung parts store and part is not listed. Vacuum is light - and the little charge that came with the battery did well - but need spare battery to do what I want and it is not available.", "helpful": 2}, {"polarity": "crit", "name": "Susan Rizk", "stars": 3.0, "title": "I wanted to love this", "content": "I bought this to replace my dyson v11. I keep a cordless stick vacuum in my kitchen closet for quick clean ups. I have 2 little boys so plenty of messes. I watched this push around the colored fry rice I was trying to vacuum and raisins. If it can’t handle the normal day to day mess, it’s not the one for me.", "helpful": 2}, {"polarity": "crit", "name": "Andy Salnikov", "stars": 3.0, "title": "It is battery that sucks", "content": "Vacuum itself is OK. Big problem is the battery, runs down very quickly, maybe 15 minutes max, nowhere near 40 minutes. Extra battery costs $150, half the price of the whole thing.\n\nUPDATE: Battery is enough to run for 6 minutes on MAX settings. It runs for approx. 30 minutes on medium, but suction power on medium is not very strong.", "helpful": 1}, {"polarity": "crit", "name": "Theresa", "stars": 2.0, "title": "Not as great as advertised", "content": "Very disappointed with this product. I have a fairly clean household with 2 kids 2 cats. I do a thurough all over vacuum 1-2x weekly with a commercial vacuum. I bought this stick vac for the daily under the table/kitchen crumbs and stray cat hair -just to stay on top of things between my big weekly cleanings. I have flat \"ruggable\" rugs. I've found that it doesn't take much pet hair at all to clog the airflow system. The red \"clogged\" light comes on anytime I try to vac a rug. It cannot pick up daily kitchen crumbs as they are too big. When I remove the floor head/pole to use as a hand vacuum, it then doesn't have the power to suck crumbs up off the floor. I did a lot of research and went with a more expensive product in hopes it would be the right tool for the job, only to find that this vac would only be best for mild dust around a vacant home or for around office building space where there again, isn't much to vacuum in the first place. It's very maneuverable, fairly light weight. It simply sucks at sucking."}, {"polarity": "crit", "name": "Oscar", "stars": 1.0, "title": "Samsung defrauding customers", "content": "Their still selling this bundle but no longer making bags making this useless.", "helpful": 3}, {"polarity": "crit", "name": "GEORGE N.", "stars": 1.0, "title": "lot of money for a piece of junk", "content": "7 months in and unit runs then stops runs then stops on and on no warranty help", "helpful": 3}, {"polarity": "crit", "name": "Amazon Customer", "stars": 1.0, "title": "Disappointing", "content": " For the money I expected more. The clean station is absolutely worthless which is why I gave it a 1 star.\nIf you have pets, the clean station cannot empty hair. It’s an expensive add on that does nothing.", "helpful": 2}, {"polarity": "crit", "name": "S Ward", "stars": 1.0, "title": "I actually hate this product", "content": "So many challenges with this item. The battery lasted about 13 minutes after being fully charged. The suction is just ok. No light. Too many pieces. Disappointing and being returned.", "helpful": 1}, {"polarity": "crit", "name": "Scoobie Doobie", "stars": 3.0, "title": "Broken attachment after just 6 months use", "content": "Owned this 6 months. We keep the vac on its hanger, with attachments. Opened the closet door one day to find he hair attachment had fallen off and broke. I believe it had been in the floor for awhile, and it’s possible the cats played with it, but regardless, it’s designed to hang, so why did this little brush part of the attachment fall off? It’s very hard to find parts for this expensive tool….", "helpful": 1}, {"polarity": "crit", "name": "Dolinda flowers", "stars": 2.0, "title": "It’s ok", "content": "This is really light weight. You get a lot of attachments but I personally don’t like having to change the head when going from floor to carpet. On max power you get 15 minutes of vacuuming. It picks up dirt but I feel like maybe a Dyson would be better. Not a powerful vacuum", "helpful": 2}, {"polarity": "crit", "name": "DM", "stars": 1.0, "title": "Very Disappointed", "content": "While this is a lightweight, great suction, easy to maneuver vacuum- the battery lasts under 20 minutes. Do not plan on using this for everyday use unless you don’t mind stopping to charge the useless battery every 20 minutes. A lot of money spent on a product that doesn’t deliver."}, {"polarity": "crit", "name": "John C.", "stars": 1.0, "title": "why?", "content": "Great styling lightweight very maneuverable. The most important thing cleaning Cordless technology Still not there yet at least not for this price point."}, {"polarity": "crit", "name": "amanda Trentacarlini", "stars": 1.0, "title": "Horrible !!!", "content": "I don’t like anything about this absolutely horrible"}, {"polarity": "crit", "name": "Allison", "stars": 1.0, "title": "MAJOR DESIGN FLAW!!! Hopefully they fix this...", "content": "We're coming from years of owning a Dyson and only went with Samsung because of a good deal and promising reviews. This vacuum could be so amazing if it weren't for the major design flaw we encountered the very first week and the extremely frustrating customer service.\n\nThe first few days were great! Everything worked as it should. 5 days in and the turbo action brush (the main attachment for carpet and rugs) stopped spinning. No problem, Samsung makes it super easy to simply press a button and pull the brush part out. Love this feature! Unfortunately that didn't fix it. Apparently a huge wad of hair got tightly wrapped around the INNER part of the end of the brush head where it is inaccessible to get to. After days of messing with it (we have engineers in the family) I finally had to break the brush off that side panel to get inside and verify this. I only dared do that because I have a new turbo action brush coming under warranty and I wanted to see how I can prevent this from happening again. Looks like I can't. 😞\n\nI understand that hair gets caught in the spinning mechanisms of all vacuums, but it is vital to allow access to clean these parts! We actually thought there was no way hair got into that little end piece and made it stop spinning, especially within only days of using the vacuum. But we were wrong and completely blown away at the wad that somehow got into a non-accessible spot (see included photos). There is a screw inside there that holds the brush head on but you can't get to that screw unless you break off the black plastic tabs securing the end piece on. They need to change that to small screws that allow access to this area. And fix the mechanism itself so hair cannot pass through into that area. As you can see in the 2nd photo, the inner black circle has rough brittle plastic that grabs hair and that's where the wad was securely stuck.\n\nLastly, Samsung customer service throughout this ordeal was a nightmare in and of itself. It was nearly impossible to get a hold of anyone and whenever I did, it was either the wrong department or they didn't speak very well English. That's fine as long as they can help me. Reaching customer service via chat was super easy when ordering, and they were really nice. But after you order it's a different department that handles these issues. The chat feature sent me to where I needed to go and I actually laughed out loud when I saw the wait time. Over 7 hours. With 3 people ahead of me. I waited a few days and tried again, but it was the same. They give an option to text but that department is super understaffed and/or busy too and just kept messaging saying sorry they are too busy and will get back to me when an agent is available. They never did and I've tried daily to get through. I finally got a hold of someone by waiting several hours for the online chat and they claim a new turbo action brush head will be sent. It wasn't. After days of trying to get a hold of them again and winning the lottery of getting an agent one day, they said it wasn't shipped and to wait a couple more weeks. I got upset at that point and they escalated the call which resulted in them promising to expedite the replacement brush head within 2 days. That came and went. Now I'm still waiting. We'll see if it eventually comes.\n\nNow, I don't mean to be so negative about this vacuum because with those issues aside, I really do like it. There are features that surpass my Dyson V8 Absolute like the extendable crevice tool (so cool!) and the inner brushes coming out for easy cleaning with the push of a button. There's an extra step to emptying the dust bin that I worried about since the Dyson is super easy in that regard, but it's not too bad. Dyson definitely wins in that area though with their simple lever to empty the canister. However, I've heard it's easier to wash out the Samsung canister because of how it empties.\n\nI'm hoping my review will help those out there who have hair around their home that can get trapped in that inaccessible end piece and those who desire a good customer service that backs up their product.", "helpful": 1}, {"polarity": "crit", "name": "federico fellini", "stars": 3.0, "title": "Wheels constantly clog on hardwood floors", "content": "This is an excellent vacuum however it has one MAJOR design flaw, the small wheels constantly clog up on hardwood floors and about every three days I have to take them apart and clean them with a small flathead screwdriver. A $400 vacuum shouldn't require this level of maintenance. Instead of including two additional vacuum heads that I don't need and will never use, Samsung should have included a small $2 flathead screwdriver to help you clean out the wheels that will inevitably gunk up w/ hair and dust on hardwood floors. How they could have overlooked this design flaw during R&D testing is beyond me.", "helpful": 8}, {"polarity": "crit", "name": "N. Jacobs", "stars": 3.0, "title": "Not worth the price", "content": "The vacuum has great suction, especially on the highest setting, but then the battery only lasts for about 5 minutes.\nI think the bundle with the base is probably a waste, and just an extra step in the already harder than necessary process of emptying the canister.\nDon't get this vacuum if you plan in doing even the shortest of rugs. The bristles won't spin, and it won't do anything. It works pretty well for just hardwood tho, and I was able to get it most of the way under my couch, which was nice.\nAll in all, we returned it, as it wasn't nice enough to justify the price tag. You can get mediocre battery life, and just as good of suction out if most rechargeable stick vacs.", "helpful": 2}, {"polarity": "crit", "name": "Shawn Ag", "stars": 3.0, "title": "Good and not so good", "content": "Great for hard surfaces. Almost useless on carpet. Machine is under powered and will not turn (spin) rug attachment even on very low fiber carpet like Berber.", "helpful": 1}, {"polarity": "crit", "name": "Laurel", "stars": 1.0, "title": "Fabulous vacuum!", "content": "Changed my review from a 5 star to 1 star after 5 months the rubber \"tire\" on the rear wheel on the bottom of the vacuum ripped in half after 5 months and while it is under warranty 1) it never should have ripped after regular daily use in that short of a time frame and 2) I now have to mail my entire vacuum into a service center to be repaired. Samsung can give no estimate for how long this will take (i.e. how long I will be without a vacuum). Won't ever buy this kind of vacuum again, even though it does a nice job vacuuming, it shouldn't be breaking after 5 months.", "helpful": 6}, {"polarity": "crit", "name": "MyHonestOpinion", "content": "Final thoughts:\n\nShould of went with my guts and bought a vac from a company that specializes in vacuum. I pounced on the sale and purchased 2 of them, since my parents are elderly and cannot carry them between floors. One unit heats up very quickly, and if I did not have a second unit for reference, I would just think it’s part of the design but I don’t think it’s suppose to get has hot as it gets. I stupidly tried resolving the issue with Samsung instead of just replacing under Amazons policy when it was still valid and now it’s a complete nightmare dealing with Samsung. It will need to be shipping out to be looked at and determined if there’s a “manufacturing defect” before they will fix it. Spend the extra couple of bucks, buy a Dyson, or even Tineco.\n\n—————\n\nEDIT: changing my 3 star review down to 1, not because the product has changed or not performed like usual, it I finally had a chance to go thru the manuals and the “warranty card”. Basically Samsung states that they want to honor the shortest warranty possible, and it sounds like they have all kinds of stipulations before you can make a warranty claim should anything happen to your machine. Samsung is not particularly known for vacuums, so a warranty would of been nice to give you peace of mind, but from the sounds of reading their card that’s placed in every box, and the reviews that has state Samsung makes it almost impossible to make any warranty claims, I don’t suggest this product at all.\n\nTineco has a 2-year warranty that’s relatively hassle-free, that alone is worth going with Tineco over Samsung should you not want to spend on a Dyson.\n\n——————————————\n\nOriginal review:\n\nReading reviews, you’d think this think was actually better then a Dyson. It’s definitely not comparable to the V11, and anyone that tells you it is either never used a Dyson V11 before or trying to make themselves feel better about not getting a Dyson. The dust canister is smaller, and like the Dyson there’s no LEDs on the front of their brush heads. I thought this would be an upgrade from my Tineco but it’s really not, if anything the lack of LEDs makes it less useful and suction doesn’t seem to be on par with the Dyson V11.", "helpful": 4}]